<unk>	0
<s>	0
</s>	0
▁	-2.61454
5266	-2.95421
▁Hiwe	-3.59366
▁Price	-3.60398
ር	-3.69062
▁አ	-3.69482
▁Size	-3.72392
▁25194535	-3.72638
▁M	-3.80674
ade	-3.83928
▁in	-3.83929
ee	-3.99601
tnam	-3.99602
▁Vie	-3.99683
▁2	-4.00609
▁Fr	-4.00904
▁Delivery	-4.0115
ድ	-4.10251
ራ	-4.1034
▁F	-4.68472
ተ	-4.71734
ን	-4.7359
በ	-4.76163
ስ	-4.76314
ም	-4.77387
ች	-4.77563
ባ	-4.77739
box	-4.78093
ይ	-4.7827
ion	-4.78271
ታ	-4.78626
ክ	-4.78626
ash	-4.78804
ወ	-4.78983
ሪ	-4.79162
ሮ	-4.79341
ሽ	-4.79341
ቅ	-4.79341
ዲ	-4.79341
ኛ	-4.7952
▁ቁጥ	-4.7952
ስል	-4.79544
05	-4.79666
▁ሀ	-4.797
▁ፎ	-4.797
▁Tera	-4.797
ሎ	-4.7988
ሻ	-4.7988
ቢ	-4.7988
ጦ	-4.7988
ፋ	-4.7988
▁In	-4.80245
▁ተ	-4.87965
00	-4.99948
▁Nike	-5.03579
▁40414243	-5.08772
▁13	-5.48264
a	-5.48462
50	-5.48569
▁0945355266	-5.53526
▁Air	-5.55044
i	-5.6053
s	-5.67661
▁Adidas	-5.72552
▁1500	-5.74392
3	-5.74875
t	-5.76264
l	-5.76929
E	-5.78874
e	-5.80044
o	-5.80318
▁14	-5.80873
▁1	-5.8237
I	-5.82592
A	-5.86045
4	-5.96668
L	-6.00789
act	-6.05112
▁S	-6.08926
▁Cont	-6.10291
▁me	-6.13054
▁40	-6.15517
▁Or	-6.17177
44	-6.18402
▁43	-6.18812
O	-6.22264
▁404142	-6.25986
▁363738	-6.29256
N	-6.34584
9	-6.36947
C	-6.38419
900	-6.40988
r	-6.43463
▁414243	-6.45895
2	-6.46249
▁Vans	-6.46768
5	-6.47936
▁T	-6.48802
7	-6.49242
R	-6.49636
u	-6.51671
▁Puma	-6.51671
B	-6.5268
▁1600	-6.52682
d	-6.57878
P	-6.5789
le	-6.59615
▁Jordan	-6.60053
▁4243	-6.63452
X	-6.66835
Y	-6.66835
▁4041	-6.68011
▁Turkey	-6.69202
0	-6.70016
▁Force	-6.70407
D	-6.7286
1	-6.74336
KE	-6.74341
n	-6.74919
ch	-6.75465
▁18	-6.75469
ilab	-6.76658
k	-6.77811
▁4142	-6.77849
43	-6.81541
CH	-6.82081
▁Rolex	-6.83328
▁2200	-6.83345
UR	-6.83438
M	-6.85645
▁1550	-6.86127
m	-6.87101
c	-6.87453
▁2000	-6.87583
800	-6.89303
h	-6.9182
▁41	-6.91988
V	-6.93459
▁Av	-6.93493
▁2600	-6.95026
g	-6.96582
▁36373839	-6.99783
K	-7.0112
▁2500	-7.01453
p	-7.03088
▁Max	-7.04792
T	-7.06021
y	-7.06507
en	-7.10036
er	-7.13183
H	-7.13548
▁42	-7.13645
U	-7.15452
x	-7.15595
S	-7.15726
PLE	-7.19489
ar	-7.22407
▁2300	-7.23584
▁1700	-7.25617
750	-7.287
▁Ch	-7.29932
▁3738	-7.32136
▁Yezzy	-7.36734
▁2400	-7.36785
ek	-7.36999
we	-7.3826
▁Leather	-7.39115
f	-7.44054
COU	-7.44055
an	-7.4486
om	-7.47173
w	-7.50206
EN	-7.50225
v	-7.51932
8	-7.5395
6	-7.54691
▁All	-7.54731
or	-7.55634
ት	-7.57588
▁3637	-7.57588
▁force	-7.60529
▁VI	-7.60572
▁hi	-7.60583
▁Airforce	-7.66684
▁Couple	-7.66684
AM	-7.67331
acket	-7.6991
BAL	-7.69912
ERS	-7.69922
AG	-7.70182
TN	-7.7049
z	-7.73243
▁price	-7.73243
▁36	-7.73271
G	-7.76402
b	-7.76473
▁Re	-7.76556
j	-7.80263
▁ROLEX	-7.80263
▁NIKE	-7.80263
ebo	-7.84202
▁Watch	-7.87813
▁Star	-7.87814
▁1650	-7.95981
▁2100	-7.96024
chool	-8.00327
▁Zo	-8.00336
▁Discount	-8.04875
▁1950	-8.0488
▁3500	-8.09636
▁1200	-8.09645
W	-8.14635
ለ	-8.14635
የ	-8.14635
▁3839	-8.14635
▁3940	-8.14635
ል	-8.36727
ና	-8.37586
መ	-8.37586
እ	-8.37586
F	-8.51486
ላ	-8.67421
ው	-8.76512
ገ	-8.86512
Z	-8.976
ያ	-9.10123
ሉ	-9.10123
ከ	-9.10123
ጫ	-9.24409
Q	-9.41075
ማ	-9.41075
ሳ	-9.41075
ደ	-9.61075
ቀ	-9.61075
ሁ	-9.86075
ብ	-9.86075
ቶ	-9.86075
ጥ	-9.86075
ረ	-9.86075
ኩ	-11.6234
J	-11.6235
ፎ	-11.6236
ቁ	-11.6237
ሀ	-11.6238
አ	-11.6238
