<unk>	0
<s>	0
</s>	0
ን	-4.13474
ና	-4.30275
ም	-4.47894
▁ላይ	-4.66625
▁በ	-4.77418
▁	-4.85286
▁እና	-4.87454
▁ነው	-4.99404
▁ከ	-5.04227
▁የ	-5.25271
▁ወደ	-5.38245
▁ጋር	-5.47803
▁ለ	-5.72218
▁ውስጥ	-5.7346
▁አቶ	-5.76557
ው	-5.79177
▁አበባ	-5.81302
▁ከተማ	-5.85709
▁ሲሆን	-5.9355
▁መሆኑን	-6.02935
▁አዲስ	-6.07688
▁ስራ	-6.07755
▁ቤት	-6.09072
ት	-6.0946
▁ጊዜ	-6.1461
▁አመት	-6.15827
▁መንግስት	-6.24876
▁የኢትዮጵያ	-6.2511
▁ደግሞ	-6.32684
▁ኢትዮጵያ	-6.34505
▁ሚኒስትር	-6.40509
▁በላይ	-6.43485
▁ሰዎች	-6.43613
▁ከፍተኛ	-6.46089
▁ክልል	-6.47032
▁ብለዋል	-6.47587
▁አም	-6.49816
▁ግን	-6.51629
▁ነበር	-6.51906
▁ቀን	-6.5709
▁እንደ	-6.57777
▁ጉዳይ	-6.60652
▁ገልፀዋል	-6.61167
▁እንዲሁም	-6.6401
▁ደረጃ	-6.65676
▁ሺህ	-6.66024
በት	-6.66283
▁በኋላ	-6.67533
▁ጨዋታ	-6.69267
▁ተናግረዋል	-6.69539
▁ወቅት	-6.70542
▁ብር	-6.7086
▁ጠቅላይ	-6.72289
▁ቡድን	-6.72971
▁አንድ	-6.7476
▁ሁኔታ	-6.75281
▁እስከ	-6.76833
▁መካከል	-6.7733
▁ምክንያት	-6.77597
▁መሰረት	-6.7787
▁ያለው	-6.78212
▁በኢትዮጵያ	-6.83096
▁ዋና	-6.85266
▁ዘመን	-6.86188
▁the	-6.86504
▁ሲ	-6.86825
▁ናቸው	-6.88872
▁ዶክተር	-6.89122
▁ድጋፍ	-6.90639
▁አመታት	-6.91281
▁ብቻ	-6.92932
▁ሚኒስቴር	-6.95679
▁ዛሬ	-6.97809
▁መንገድ	-6.98526
ኛ	-6.99067
▁ይህ	-7.01212
▁መረጃ	-7.02368
▁የስራ	-7.03169
▁አቀፍ	-7.03645
▁ያሉት	-7.0372
▁አገልግሎት	-7.03873
▁ከዚህ	-7.03986
▁ምክር	-7.04002
▁ችግር	-7.04521
▁ነገር	-7.04547
▁በዚህ	-7.04756
▁ሁለት	-7.0509
▁ሚሊዮን	-7.07076
▁ጉዳዮች	-7.07216
▁ብሄራዊ	-7.09193
▁የተለያዩ	-7.09501
▁ልማት	-7.10807
▁በፊት	-7.11167
ስ	-7.11304
▁አሁን	-7.11724
▁ግብ	-7.12242
▁ቤቱ	-7.12552
▁ኳስ	-7.14226
▁ድርጅት	-7.15873
▁ነጥብ	-7.16024
▁ጀምሮ	-7.17484
▁አ	-7.17926
▁ሀገራት	-7.17963
▁የውጭ	-7.18049
▁ሀይል	-7.18282
▁ቁጥር	-7.18673
▁አስተዳደር	-7.20207
▁አለም	-7.21006
▁ምክትል	-7.21254
▁ሳምንት	-7.22858
▁ፕሬዚዳንት	-7.23428
▁ወር	-7.24154
▁በኩል	-7.24261
▁ሌሎች	-7.26296
ኛው	-7.26509
▁እንደሆነ	-7.27015
▁ትምህርት	-7.27067
▁በመሆኑ	-7.27072
▁በመቶ	-7.27586
▁ህዝብ	-7.27983
▁2012	-7.28444
ል	-7.2865
▁ሚኒስትሩ	-7.29159
▁ሊግ	-7.29536
▁በርካታ	-7.30097
▁በማድረግ	-7.30477
▁መግለጫ	-7.30806
▁በአዲስ	-7.32017
▁ፖሊስ	-7.32025
▁በተለያዩ	-7.3223
▁አካላት	-7.33419
▁ለማድረግ	-7.33801
▁ቢ	-7.34138
▁ጥረት	-7.34688
▁ግንኙነት	-7.34978
▁ህግ	-7.36755
▁እንቅስቃሴ	-7.37419
▁ውይይት	-7.37626
▁ተቋማት	-7.37752
▁ድረስ	-7.37973
▁ጨምሮ	-7.38067
▁አባላት	-7.38068
▁ቡና	-7.38191
▁ግንባታ	-7.38467
▁ውጤት	-7.38899
▁ተከትሎ	-7.39077
▁እድል	-7.39259
▁ሲሉ	-7.39714
▁ለማግኘት	-7.407
▁ሀላፊ	-7.40991
▁ተብሎ	-7.41592
▁ያለውን	-7.42904
▁አህመድ	-7.43934
▁ፅህፈት	-7.44082
▁ጉዳት	-7.44549
▁ደቂቃ	-7.45437
ር	-7.4548
▁የነበረው	-7.45843
▁ሰአት	-7.45915
▁ቫይረስ	-7.46314
▁ቀደም	-7.47181
▁ስለ	-7.48245
▁ሰው	-7.48246
▁ቤቶች	-7.48395
▁መሆኑ	-7.4849
▁የአፍሪካ	-7.48514
▁በሚል	-7.48633
▁ማድረግ	-7.48853
▁1	-7.49269
ነት	-7.49508
▁ቀናት	-7.49734
▁ዙሪያ	-7.49938
▁እለት	-7.50301
▁ሀገር	-7.50589
▁ሶስት	-7.515
▁የመንግስት	-7.51715
▁ሆኖ	-7.52188
▁ዘርፍ	-7.52218
▁ምርጫ	-7.5238
▁ስራዎች	-7.52495
▁ያሉ	-7.52966
▁ጥያቄ	-7.53378
▁አስታውቋል	-7.54278
▁ኤፍቢሲ	-7.54669
▁10	-7.54936
▁ባንክ	-7.55
▁ያለ	-7.55395
▁2	-7.55647
▁ዜጎች	-7.55877
▁ተጫዋቾች	-7.56376
▁ቢሆንም	-7.56532
▁አካባቢ	-7.56597
▁ሙሉ	-7.56947
▁የአለም	-7.57294
▁ፍርድ	-7.57407
▁ዶላር	-7.57421
▁ሰላም	-7.57759
▁ስር	-7.57783
▁ቃል	-7.57882
▁2013	-7.58236
▁ብዙ	-7.58576
▁ጥሩ	-7.58583
▁የአዲስ	-7.58786
▁ስርአት	-7.58816
▁ትኩረት	-7.59124
▁ኮሚሽን	-7.59451
▁መልኩ	-7.60343
ባቸው	-7.60673
▁በተጨማሪ	-7.60891
▁እንደገለፁት	-7.61283
▁በተለይ	-7.61532
▁አፍሪካ	-7.61609
▁ስምምነት	-7.62084
▁3	-7.62202
▁እ	-7.62284
▁አሰልጣኝ	-7.62526
▁አስታወቀ	-7.62943
▁ጨዋታዎች	-7.63251
▁ውሳኔ	-7.63997
▁ባለፈው	-7.64295
▁ወራት	-7.64434
▁የሚገኙ	-7.64466
▁ጥሪ	-7.64511
▁ቢሮ	-7.64552
▁ፓርቲ	-7.64616
▁የጤና	-7.64904
▁ሆነ	-7.65352
s	-7.65414
ች	-7.65484
▁ኮሚቴ	-7.65768
▁አስታውቀዋል	-7.65892
▁አገራት	-7.66218
▁ውድድር	-7.66653
▁ሁሉ	-7.66659
▁መሆናቸውን	-7.66659
▁በበኩላቸው	-7.67283
▁ዳር	-7.67513
▁ዳይሬክተር	-7.67734
▁ጥቃት	-7.67859
▁5	-7.6844
▁ሚሊየን	-7.6863
▁ልዩ	-7.68849
▁የፖለቲካ	-7.68981
▁አካባቢዎች	-7.69208
▁የህዝብ	-7.69659
▁አገር	-7.69892
▁ለውጥ	-7.70089
▁ይገኛል	-7.70155
▁ይታወሳል	-7.71776
▁ጉባኤ	-7.72201
▁ይህን	-7.72258
▁ዞን	-7.72762
▁ቦታ	-7.73551
▁ይሆናል	-7.73898
▁to	-7.75302
▁ሊ	-7.75362
▁ዝግጅት	-7.75859
▁ሲል	-7.76355
▁ሀሳብ	-7.76376
▁እርምጃ	-7.76428
▁ተብሏል	-7.76666
▁ጠቁመዋል	-7.76746
▁ተገልጿል	-7.77098
▁ወይም	-7.77251
▁እንዲ	-7.77712
▁አይነት	-7.78159
▁4	-7.78235
▁አቅም	-7.784
▁ሱዳን	-7.786
▁አንዱ	-7.78951
▁in	-7.7948
▁እስካሁን	-7.79595
▁ቢሊዮን	-7.79626
▁አደጋ	-7.7988
▁መሪ	-7.80076
▁ሁሉም	-7.80201
▁አጋማሽ	-7.80564
▁መከላከያ	-7.80575
▁በጋራ	-7.80843
▁ክፍል	-7.82211
ed	-7.82522
▁እንጂ	-7.82776
▁በአንድ	-7.83162
▁እቅድ	-7.83617
▁ሂደት	-7.83991
▁የሚል	-7.84303
▁ሳይሆን	-7.84849
▁ግድብ	-7.8505
▁ተጨማሪ	-7.85081
▁ውጪ	-7.85212
▁የክልሉ	-7.8531
▁ንግድ	-7.8536
▁ተግባር	-7.85648
▁ያላቸው	-7.8572
▁ዋንጫ	-7.85844
▁መንግስታት	-7.859
▁ቡድኑ	-7.85925
▁በአሁኑ	-7.86023
▁ባለፉት	-7.86128
▁በአለም	-7.86834
▁a	-7.86837
▁ህይወት	-7.86938
▁በመሆን	-7.87097
▁ምላሽ	-7.87214
▁ታውቋል	-7.87337
▁እንደነበር	-7.87601
ዎች	-7.8769
▁ሆነው	-7.8776
▁ያህል	-7.8809
▁20	-7.88199
▁ምን	-7.88644
▁መረጃዎችን	-7.88781
▁የልማት	-7.88963
ብ	-7.89014
▁አካል	-7.89178
▁ምንም	-7.89314
▁መሆኑንም	-7.89361
▁አስረድተዋል	-7.89387
▁ሀብት	-7.89391
▁ምርመራ	-7.89558
▁ጊዮርጊስ	-7.89775
▁የኮሮና	-7.89937
▁ይፋ	-7.90211
1	-7.90218
▁የፋና	-7.90463
▁በጀት	-7.90519
▁ትልቅ	-7.91013
▁በቀጣይ	-7.91263
ውን	-7.9137
▁ችግሮች	-7.9234
ቱ	-7.92355
▁አይደለም	-7.9239
▁ተ	-7.92525
▁መሆን	-7.92563
▁መብት	-7.92822
▁ይገባል	-7.92922
▁ሜትር	-7.92942
በ	-7.93038
▁ማእከል	-7.93702
▁የነበሩ	-7.94056
▁በተለይም	-7.94237
▁ገቢ	-7.9427
▁የገለፁት	-7.94396
▁ውሀ	-7.94641
▁አራት	-7.9484
▁ወጣቶች	-7.94968
▁በማለት	-7.95381
▁የህግ	-7.95399
▁የንግድ	-7.955
▁አብይ	-7.95672
▁ትናንት	-7.95776
▁ይጠበቃል	-7.96395
▁በቅርቡ	-7.9643
▁ድምፅ	-7.96518
▁ኤፍ	-7.96705
▁ዙር	-7.96844
▁ዩኒቨርሲቲ	-7.97138
▁ይህንን	-7.9767
▁ብሎ	-7.97788
▁ዶር	-7.97817
▁6	-7.97899
▁በተጨማሪም	-7.97997
▁መልእክት	-7.98384
▁በአል	-7.98862
▁አምስት	-7.98873
▁ክለቦች	-7.99192
▁ገንዘብ	-7.9948
▁ውጭ	-7.9956
▁የሰላም	-7.99616
▁አመራሮች	-7.99856
▁መስራት	-8.00318
▁ብለው	-8.00508
▁ግብር	-8.0106
▁በሙሉ	-8.0123
▁የፀጥታ	-8.01671
ዋ	-8.01707
የ	-8.02012
▁በዚህም	-8.02095
▁ወይዘሮ	-8.02125
▁የተሻለ	-8.02564
▁ሴቶች	-8.02883
▁ጤና	-8.0316
▁ሚና	-8.03205
▁የሆነ	-8.03276
▁የሚያስችል	-8.0341
▁የውድድር	-8.03419
▁ለመከላከል	-8.03427
▁ክለብ	-8.03688
▁ህብረት	-8.04029
▁በፍጥነት	-8.04061
▁መሀመድ	-8.04365
▁ባለ	-8.04584
▁ተወካዮች	-8.04822
▁ሺ	-8.04896
▁እንደሚገባ	-8.05037
▁ባለው	-8.05825
▁11	-8.05919
▁የጋራ	-8.06091
▁መርሀ	-8.06693
▁ጎል	-8.06916
▁ስጋት	-8.06962
▁የአሜሪካ	-8.07317
▁መልካም	-8.07378
▁ስቴትስ	-8.07729
▁ፍላጎት	-8.07812
▁ህዝቦች	-8.07905
▁ተግባራዊ	-8.08328
▁የትምህርት	-8.08411
▁ገልጿል	-8.08448
ቸው	-8.08535
▁ጨዋታው	-8.08676
▁ብሏል	-8.09112
▁ተማሪዎች	-8.09272
▁ክፍለ	-8.09339
▁ገፃችን	-8.0941
ያ	-8.09625
▁የሚገኘው	-8.09958
▁ሰራተኞች	-8.0996
▁ኢትዮጵያውያን	-8.10003
▁ደቡብ	-8.10287
▁ሜዳ	-8.10381
▁የሆነው	-8.1046
▁ወረዳ	-8.10504
▁የውሀ	-8.10739
▁8	-8.10803
▁የሚ	-8.1092
▁መስመር	-8.10949
▁በተመለከተ	-8.11024
▁ሀይሎች	-8.11167
▁አስተዋፅኦ	-8.11336
▁በዛሬው	-8.11423
▁ባህር	-8.11446
▁በተያያዘ	-8.11469
▁በክልሉ	-8.11475
▁ይህም	-8.12008
▁7	-8.12014
▁አመልክተዋል	-8.12096
▁ባለሙያዎች	-8.12177
▁ገለፃ	-8.12414
▁ዋጋ	-8.12501
▁30	-8.12555
▁ስፖርት	-8.12618
▁መሬት	-8.12675
▁ቆይታ	-8.12995
▁15	-8.13321
▁አየር	-8.13345
▁19	-8.13411
▁12	-8.13707
▁አምባሳደር	-8.13757
▁በሰጡት	-8.141
ላቸው	-8.14294
▁ድርጅቶች	-8.14314
▁እድገት	-8.14391
▁ከኢትዮጵያ	-8.15086
▁በቁጥጥር	-8.15394
▁ርእሰ	-8.15411
▁አባል	-8.15529
▁ቡድኖች	-8.15585
▁ጠንካራ	-8.15788
▁ባ	-8.15836
▁ክስ	-8.1644
▁አል	-8.16763
▁ፕሮጀክት	-8.16906
▁ነዋሪዎች	-8.17147
▁መጠን	-8.17153
▁አሁንም	-8.17242
▁በሀገሪቱ	-8.17471
▁ወጪ	-8.17534
▁ወንጀል	-8.18086
▁እየተሰራ	-8.18125
▁ሰራዊት	-8.18241
▁ጥቅምት	-8.18417
▁አስፈፃሚ	-8.18433
▁ስብሰባ	-8.18506
ሺ	-8.18539
▁ታሪክ	-8.18824
▁አለ	-8.20018
▁በአጠቃላይ	-8.20718
▁በጣም	-8.21067
▁የሀገሪቱ	-8.21078
▁ቅዱስ	-8.21302
▁ምርት	-8.21312
▁ባለስልጣን	-8.21447
▁አቃቤ	-8.21596
▁ፕሪምየር	-8.21689
▁ተጠቃሚ	-8.21791
▁ያገኘነው	-8.22009
▁ነፃ	-8.22208
▁ታህሳስ	-8.22249
▁መስከረም	-8.22369
▁ዘግቧል	-8.22481
▁ከተሞች	-8.22773
▁የአማራ	-8.22913
▁የሆኑ	-8.22983
▁መድረክ	-8.23335
▁የመጀመሪያ	-8.23442
▁አዋጅ	-8.23587
▁ወረርሽኝ	-8.2377
▁ጥናት	-8.23825
▁መስሪያ	-8.2456
▁ጥር	-8.24737
▁ጥቅም	-8.24882
▁ክልሎች	-8.25022
▁of	-8.25118
▁ፓርቲዎች	-8.25795
▁በአፍሪካ	-8.25844
▁ወቅታዊ	-8.2638
▁የፌዴራል	-8.26426
ዉ	-8.26433
▁ሀላፊነት	-8.26828
▁አቢይ	-8.27037
▁ተጫዋች	-8.27143
▁21	-8.27462
▁በሆነ	-8.27561
▁ስነ	-8.27625
▁ሀላፊዎች	-8.277
▁ተስፋዬ	-8.27838
▁እየሰራ	-8.28132
▁ተስፋ	-8.28333
▁ሰኔ	-8.28529
▁እንዲሆን	-8.28591
▁አድርጓል	-8.28914
▁ሀዋሳ	-8.28932
▁ግንቦት	-8.28957
▁ፕሬዝዳንት	-8.29005
▁አንፃር	-8.29422
▁ግጭት	-8.2957
▁አላማ	-8.29662
ህ	-8.29716
▁በከፍተኛ	-8.29791
▁በታች	-8.30012
▁የደቡብ	-8.30198
▁ህገ	-8.30452
▁አድርጎ	-8.30508
ድ	-8.30602
▁ተፅእኖ	-8.30618
▁አመቱ	-8.30686
▁ከሆነ	-8.30744
▁የገንዘብ	-8.30813
▁እጅግ	-8.30874
▁24	-8.30913
▁9	-8.3101
▁ብዙሀን	-8.31036
▁ቻናል	-8.31462
▁and	-8.31654
▁ውል	-8.32125
▁ስልጠና	-8.3215
ለ	-8.3247
▁የህክምና	-8.33283
▁ባደረጉት	-8.33434
▁የነበረ	-8.33904
ከ	-8.33939
▁እግር	-8.34044
▁ሌላ	-8.34158
▁ይገኛሉ	-8.34262
▁በአገሪቱ	-8.34309
ing	-8.34544
▁በሀላ	-8.34646
▁ክለቡ	-8.34741
▁ገልፀው	-8.34946
▁አገሮች	-8.34979
▁መሪዎች	-8.35025
▁ሆኗል	-8.35074
▁ከፍ	-8.35419
▁ይ	-8.35542
▁ባለስልጣናት	-8.35694
▁የኢኮኖሚ	-8.35709
▁ተሳትፎ	-8.35835
▁መልክ	-8.36092
▁ንብረት	-8.36162
▁ማለት	-8.36214
▁የካቲት	-8.3633
▁መ	-8.36376
▁ያ	-8.36401
▁13	-8.36523
▁ሙከራ	-8.36728
▁አቅርበዋል	-8.36892
▁ትኩስ	-8.3695
▁ትብብር	-8.37475
▁በደቡብ	-8.37644
▁ለኢትዮጵያ	-8.37711
▁እንደተናገሩት	-8.37716
▁ክፍሎች	-8.37763
▁ዘንድ	-8.37765
▁አሜሪካ	-8.3805
▁ሪፖርት	-8.38087
▁ስድስት	-8.38113
▁ዘገባ	-8.38556
▁አዳማ	-8.3858
ኝ	-8.38602
▁ቅጣት	-8.38643
▁ያላቸውን	-8.38693
▁የነበሩት	-8.38713
▁ለመፍታት	-8.39232
▁ጥበቃ	-8.39301
▁14	-8.39414
▁ሰፊ	-8.39479
▁ግለሰቦች	-8.39914
▁የተባለው	-8.40009
▁የተናገሩት	-8.40402
▁ህክምና	-8.40778
▁ንግግር	-8.40946
▁መጋቢት	-8.40995
▁በቀለ	-8.41121
▁ሁለቱ	-8.41222
▁ለመስጠት	-8.41338
ዎቹ	-8.41437
▁የለም	-8.4148
ለት	-8.41572
▁ይችላል	-8.41785
▁ችሏል	-8.41936
ክ	-8.42053
20	-8.42155
▁አሰራር	-8.42582
▁አመራር	-8.42624
2	-8.42788
▁ኪሎ	-8.43093
▁አሸናፊ	-8.43356
▁መፍትሄ	-8.43375
▁የድምፅ	-8.43391
19	-8.43437
ዎ	-8.43715
▁አዳዲስ	-8.43932
▁ሳይ	-8.43957
▁ኢንዱስትሪ	-8.44062
▁የትግራይ	-8.44434
▁የግብ	-8.44529
▁ተቋም	-8.44549
▁ሁለተኛ	-8.44699
▁እንኳን	-8.44717
▁ድል	-8.4477
▁አባ	-8.44826
▁የሀገር	-8.44865
▁ይታወቃል	-8.45104
▁የሰብአዊ	-8.45255
▁ፕሮግራም	-8.45298
▁አለበት	-8.45333
▁እየተደረገ	-8.45439
▁አድርገዋል	-8.4548
▁ቦታዎች	-8.45593
▁ደህንነት	-8.45645
▁የነበረውን	-8.45893
▁ግርማ	-8.45912
▁አስመልክቶ	-8.4614
▁ሊጉ	-8.46169
▁ገበያ	-8.46189
▁ህዳር	-8.46242
▁አጠቃላይ	-8.464
▁የሰው	-8.46466
▁ከባድ	-8.46525
ሉ	-8.46552
▁ስፍራ	-8.46609
▁የሆኑት	-8.46763
▁አብመድ	-8.47496
▁ረገድ	-8.47531
▁የኢፌዴሪ	-8.47543
e	-8.47623
▁እንዳሉት	-8.47681
▁ይዞ	-8.47728
▁ጫና	-8.47739
▁ያመለክታል	-8.4805
▁እየተካሄደ	-8.48233
10	-8.48362
▁ኤሌክትሪክ	-8.48623
▁ለመስራት	-8.48733
ከዚህ	-8.48733
▁እጥረት	-8.48766
▁ታደሰ	-8.4879
▁ጎን	-8.48826
▁ቦርድ	-8.48882
3	-8.49144
▁የሚሆኑ	-8.49167
▁16	-8.4936
▁የአየር	-8.49485
▁ሀምሌ	-8.49561
▁በተመሳሳይ	-8.5006
▁መቶ	-8.50387
▁25	-8.50544
▁ከንቲባ	-8.506
▁የተባበሩት	-8.50747
▁እንዳለ	-8.5087
▁እያደረገ	-8.5103
▁እንደሚችል	-8.51226
▁httpst	-8.51242
▁ቴክኖሎጂ	-8.51281
▁መኮንን	-8.51381
▁ፈቃድ	-8.51406
▁አዲሱ	-8.51428
▁ተጫዋቾችን	-8.5159
▁ስልጣን	-8.51632
▁በአጭር	-8.51805
▁ባሻገር	-8.51829
▁የጦር	-8.52065
▁መስጠት	-8.52067
▁ኮርፖሬት	-8.52136
▁ቫይረሱ	-8.52252
▁ስራዎችን	-8.52392
▁ወጣት	-8.52458
▁ወዲህ	-8.52509
▁2011	-8.52629
▁ህዳሴ	-8.52741
▁ኢኮኖሚ	-8.52761
▁ለአዲስ	-8.52967
▁በአግባቡ	-8.5319
▁ጉዞ	-8.53223
▁ምት	-8.5341
▁18	-8.53445
▁አጋጣሚ	-8.53522
▁ወሳኝ	-8.53848
▁ድርሻ	-8.54065
▁ሲሆኑ	-8.54264
ሽ	-8.54297
▁የምግብ	-8.54313
▁በመሆኑም	-8.54401
▁ገፅ	-8.55015
▁የአገሪቱ	-8.55144
▁ማህበረሰብ	-8.55182
▁ግብፅ	-8.5521
▁አስተያየት	-8.55342
▁እንዳለበት	-8.55409
▁አማካኝነት	-8.55579
▁አንድነት	-8.55795
▁አፈፃፀም	-8.55803
▁ከአዲስ	-8.56073
▁አይ	-8.56131
▁እንደሚገኝ	-8.56242
▁ኩባንያ	-8.56427
አዲስ	-8.56455
▁22	-8.5649
▁ያድርጉ	-8.56674
▁በቂ	-8.56711
▁የምርጫ	-8.56919
▁ወጥ	-8.57021
▁ዳይሬክተሩ	-8.57179
▁ፌዴሬሽን	-8.57179
▁ነሀሴ	-8.57419
▁አቋም	-8.5744
▁ድቻ	-8.57601
▁መንገዶች	-8.57728
▁ዘርፎች	-8.57865
▁ነገ	-8.58125
▁ውጤታማ	-8.58359
▁ሰብስክራይ	-8.5842
▁ድሬዳዋ	-8.58691
▁ጉብኝት	-8.58748
▁በመንግስት	-8.58766
▁የመከላከያ	-8.58813
▁አስፈላጊ	-8.58918
▁በመጠቀም	-8.59114
▁መሆናቸው	-8.59173
▁መደበኛ	-8.59271
▁ያደረጉት	-8.59289
▁ቁጥጥር	-8.59416
▁ባለፈ	-8.5943
▁ይሁን	-8.59431
▁ባለሀብቶች	-8.59485
▁በቫይረሱ	-8.59809
▁መስተዳድር	-8.59912
▁የቀድሞ	-8.59924
▁አንዳንድ	-8.59953
▁ብሮድካስቲንግ	-8.60362
▁Ketema	-8.60365
▁ተችሏል	-8.6063
▁ማህበራዊ	-8.60646
ትዊተር	-8.60688
▁አሳስበዋል	-8.60832
▁ስርጭት	-8.61174
▁ጅማ	-8.61226
▁አርሶ	-8.613
▁ተገለፀ	-8.61337
ጠቅላይ	-8.61697
▁ሰባት	-8.61732
▁የግል	-8.61819
▁የሚታወስ	-8.61846
▁ቋሚ	-8.62369
▁ማብራሪያ	-8.62514
▁መሳሪያ	-8.62561
▁ከአንድ	-8.626
▁ለመፍጠር	-8.62671
▁ስታዲየም	-8.62714
▁በኦሮሚያ	-8.62836
▁ትራምፕ	-8.6301
▁ኩባንያዎች	-8.63075
አቶ	-8.63228
▁ምንጭ	-8.63326
▁አቅጣጫ	-8.63349
▁ዜና	-8.63448
▁መንግስቱ	-8.63473
▁ጭምር	-8.63687
▁ቴሌቪዥን	-8.6371
▁አስተዳደሩ	-8.63857
5	-8.63979
▁ለህዝብ	-8.64047
▁በተደጋጋሚ	-8.64217
▁17	-8.64664
▁ፕሮጀክቶች	-8.64674
▁ኤጀንሲ	-8.65486
▁እንዳለው	-8.65562
▁በሌሎች	-8.65773
▁ከበደ	-8.65975
▁ኮሚሽነር	-8.65978
▁ተመሳሳይ	-8.66222
▁አቅርቦት	-8.66506
▁ፋይል	-8.6661
▁የኦሮሚያ	-8.66676
▁እርዳታ	-8.67251
▁ሆኖም	-8.67384
d	-8.67412
▁አሉ	-8.67753
▁መረጃዎች	-8.67873
▁እየ	-8.67955
▁የከተማ	-8.68035
▁ቢሆን	-8.6812
▁ይበልጥ	-8.68273
▁ኢትዮጵያን	-8.68383
▁መጨረሻ	-8.68475
▁ገለፁ	-8.6869
▁ለማወቅ	-8.68801
▁በወቅቱ	-8.68925
▁ልምድ	-8.69055
▁ሀ	-8.69079
▁ተግባራት	-8.69097
▁ብርሀኑ	-8.69185
▁ሲዳማ	-8.69259
▁ከተለያዩ	-8.69272
▁ሀይሉ	-8.69288
▁አቻ	-8.693
▁ሰላማዊ	-8.69327
▁አብራርተዋል	-8.69353
▁ህብረተሰቡ	-8.6945
▁አበበ	-8.69458
▁እነዚህ	-8.69967
▁ቢሊየን	-8.6997
▁2010	-8.70178
▁በሀገር	-8.70224
▁ማህበር	-8.70242
▁ያዳምጡ	-8.70368
▁ዝርዝር	-8.70388
▁ሰጥተዋል	-8.70456
▁ህዝቡ	-8.70502
▁ጋዜጣ	-8.70578
▁ካ	-8.70639
▁ሽልማት	-8.70656
▁እግርኳስ	-8.70696
▁ማግኘት	-8.7078
▁መገናኛ	-8.70904
▁በዚሁ	-8.70931
▁ስም	-8.71136
▁ጠቅሰው	-8.71149
▁ከውጭ	-8.71362
▁ለማሳደግ	-8.71408
▁በትግራይ	-8.71438
▁ጨዋታውን	-8.71532
▁ጥያቄዎች	-8.71533
▁ትእዛዝ	-8.71607
▁እኤአ	-8.71773
▁መልስ	-8.71883
▁መደረጉን	-8.71952
▁በመስጠት	-8.72005
▁ነበሩ	-8.72055
▁ድረ	-8.72085
▁እንዲህ	-8.72167
ፍ	-8.72269
▁ያደረገ	-8.72421
▁በአማራ	-8.72429
▁ሆስፒታል	-8.72454
▁ተያይዞ	-8.72671
▁የግብርና	-8.72701
▁ድርድር	-8.728
▁ዴሞክራሲያዊ	-8.72827
▁በሁለት	-8.73058
▁ክፍያ	-8.73106
▁ዘመቻ	-8.73278
▁ሀገሮች	-8.73376
▁ሄክታር	-8.73633
▁ባወጣው	-8.73638
ቶ	-8.73797
▁23	-8.74066
▁ሰላምና	-8.74199
▁በተካሄደው	-8.74212
2012	-8.74236
▁ተደርጓል	-8.7443
▁ህጋዊ	-8.74443
▁ደሳለኝ	-8.74512
▁ስራው	-8.74573
▁ህፃናት	-8.74679
▁ተሳታፊ	-8.74799
▁ለዚህ	-8.74825
▁ሊቀመንበር	-8.74826
▁ያደረገው	-8.74989
▁አንስተዋል	-8.75086
▁ረቂቅ	-8.75113
▁የብሄራዊ	-8.75235
▁እንደሆነም	-8.75433
▁በአካባቢው	-8.75455
▁ይልቅ	-8.75609
▁ሊሆን	-8.75613
▁ዘገባው	-8.75828
▁የስፖርት	-8.75843
▁ሲሉም	-8.7591
▁ክትትል	-8.75978
▁በስልክ	-8.76476
▁ችግሮችን	-8.76503
▁ሀላፊው	-8.76523
▁ቅድመ	-8.76573
▁በሁሉም	-8.76704
▁አቀፉ	-8.76818
▁አስኪያጅ	-8.7695
ችን	-8.77047
▁ፋሲል	-8.77104
▁ኮሚቴው	-8.77277
▁አቀባይ	-8.77337
▁በኮሮና	-8.77362
▁ባለቤት	-8.77494
▁ኢዜአ	-8.77533
▁የፌደራል	-8.77658
▁ሀገሪቱ	-8.7767
▁የሁለቱ	-8.77963
▁ከነማ	-8.78051
▁ቻይና	-8.78106
▁ለማጠናከር	-8.78114
▁ቅዳሜ	-8.78512
▁እኛ	-8.78608
▁የኤሌክትሪክ	-8.78636
ዝ	-8.78687
▁ምድብ	-8.78693
▁የሚለው	-8.78719
▁አልፎ	-8.78757
▁ዮሀንስ	-8.78964
▁ምግብ	-8.79
▁እምነት	-8.79015
▁ስታድየም	-8.79031
▁በሚገኘው	-8.7941
▁አድርገው	-8.79457
▁አጥቂ	-8.79474
ይ	-8.79535
▁እንዳ	-8.7965
▁እንዴት	-8.79724
▁ከሁለት	-8.79825
▁ኢንጂነር	-8.79889
▁ማ	-8.79965
▁ጌታቸው	-8.80002
▁እሁድ	-8.80164
▁ተጠናቋል	-8.80168
▁ሆቴል	-8.80199
4	-8.80661
▁ምቹ	-8.80931
ታ	-8.80975
▁ፈጣን	-8.80997
▁እንደሚ	-8.81049
▁ኢንቨስትመንት	-8.81122
▁ኢኮኖሚያዊ	-8.81155
▁27	-8.81293
ሺህ	-8.81299
▁ሰለሞን	-8.81329
ማ	-8.81656
▁ጊዜያት	-8.81814
▁በነበረው	-8.81843
▁ወላይታ	-8.82069
▁በይፋ	-8.82099
▁የመጀመሪያው	-8.82233
▁on	-8.82241
▁ወታደራዊ	-8.82402
▁be	-8.82454
▁የሴቶች	-8.82708
▁ጠቁመው	-8.82824
▁ጠይቀዋል	-8.82839
▁በተደረገው	-8.83028
▁መከላከል	-8.83081
▁አመልክቷል	-8.83425
ሁ	-8.83526
▁26	-8.83685
▁ጦር	-8.83685
▁የአንድ	-8.83873
▁በሌላ	-8.84104
▁ውድድሮች	-8.84253
▁ሀገራዊ	-8.84399
በተጨማሪም	-8.84401
15	-8.84467
▁ከሌሎች	-8.84478
▁ጦርነት	-8.84743
▁በህግ	-8.84931
▁ደስታ	-8.84969
▁እኔ	-8.8497
▁ርቀት	-8.8497
▁እውቅና	-8.85044
▁ዘንድሮ	-8.85147
▁የመጀመርያ	-8.85189
▁ዝግጁ	-8.85214
▁ያመላክታል	-8.85311
▁ፕሮፌሰር	-8.8552
▁ለአንድ	-8.85834
ሩ	-8.85968
▁ተጠናክሮ	-8.86034
▁ወገኖች	-8.86143
▁ስላሉ	-8.8625
▁ጠቅሰዋል	-8.86308
▁የዩናይትድ	-8.86318
▁ከእኛ	-8.86325
▁በመግለፅ	-8.86504
▁ፍፁም	-8.86736
m	-8.8681
▁ልጅ	-8.86844
▁ምስራቅ	-8.86919
▁በውጭ	-8.86958
▁The	-8.87297
▁ሴት	-8.87437
▁ጥንቃቄ	-8.87515
▁70	-8.87788
▁ሊያ	-8.87831
17	-8.87937
▁አማራጭ	-8.88066
▁ምንጮች	-8.88261
▁ድንበር	-8.88296
▁እየተ	-8.88527
▁ተነግሯል	-8.88595
የኢትዮጵያ	-8.88686
▁የአገር	-8.88693
▁ሰዎችን	-8.88713
▁ግቦች	-8.88763
▁ልዩነት	-8.89064
▁ጠባቂ	-8.89279
▁ቀዳሚ	-8.89303
▁መሰል	-8.89369
▁ድርጊት	-8.89372
▁በሁለቱ	-8.89441
▁for	-8.89667
▁28	-8.8968
▁በሰላም	-8.89779
2011	-8.8987
▁አለው	-8.89877
▁ለማረጋገጥ	-8.8991
▁ባደረገው	-8.89973
▁50	-8.90065
▁ለማ	-8.9016
▁የበለጠ	-8.90175
▁እንደሚሆን	-8.90232
▁ዋስትና	-8.90254
▁ወረዳዎች	-8.90275
▁የፅሁፍ	-8.90353
▁ስምንት	-8.9038
ታል	-8.90399
▁ደብዳቤ	-8.90427
▁በስፋት	-8.90471
▁ደቂቃዎች	-8.9067
▁ሰነድ	-8.90802
▁አገሪቱ	-8.90947
▁በአገር	-8.90973
በዚህም	-8.91121
▁አስፈላጊውን	-8.91126
▁የመጨረሻ	-8.91154
▁መቐለ	-8.91255
▁ዶናልድ	-8.91311
▁አሰፋ	-8.91351
▁ባህል	-8.91437
▁ለመመለስ	-8.91471
▁እንዳይ	-8.91661
▁ነፃነት	-8.91891
ናል	-8.91901
ኑ	-8.91943
▁ዳግም	-8.91964
▁በአሜሪካ	-8.91997
▁ዘመናዊ	-8.92348
▁በቀጥታ	-8.92363
▁ችሎት	-8.92472
▁በድጋሚ	-8.92553
▁ግዛት	-8.92731
▁እንደሚገኙ	-8.92831
▁የሚችል	-8.9291
▁በሚገኙ	-8.93032
▁https	-8.93038
▁መፍጠር	-8.93162
▁ቡድኑን	-8.93364
▁ተደርጎ	-8.93582
▁ሰጥቷል	-8.93607
▁ለዚህም	-8.93672
▁ጣቢያ	-8.93682
▁ብቃት	-8.93894
▁ስርአቱ	-8.94003
▁Ethiopia	-8.94023
▁ልምምድ	-8.94062
▁ትክክለኛውን	-8.94172
▁እንዳለባቸው	-8.94269
▁መጠቀም	-8.94516
▁ሳ	-8.94643
ዬ	-8.94843
▁ቀጠሮ	-8.949
▁የሚገኙት	-8.9503
▁ቱሪዝም	-8.95092
▁ዘላቂ	-8.95124
▁የሱዳን	-8.95202
▁አለባቸው	-8.95204
▁ድርጅቱ	-8.95229
▁ስራውን	-8.95261
▁ብሄር	-8.95315
▁በስራ	-8.95475
▁ምርቶች	-8.95491
▁ሰኞ	-8.95511
6	-8.95627
▁ማስከበር	-8.95676
▁ደጋፊዎች	-8.95741
▁የዩ	-8.95829
mefanatelevision	-8.96258
▁ጥቂት	-8.96418
▁ብልፅግና	-8.96452
▁የአውሮፓ	-8.96456
▁ፊት	-8.96578
▁ቤተ	-8.96603
▁በሁለተኛው	-8.96626
▁አስር	-8.96776
▁ስሜት	-8.96829
▁አትሌቶች	-8.96926
▁ደመቀ	-8.96964
▁የሀይማኖት	-8.97035
▁ደደቢት	-8.97109
▁አስታወቁ	-8.97189
ሮ	-8.97255
▁ማሻሻያ	-8.97374
ቲዩብ	-8.97436
▁ስደተኞች	-8.97523
▁የኢንቨስትመንት	-8.97579
▁የቀድሞው	-8.97708
▁ቆይቷል	-8.97904
▁ሚያዝያ	-8.98056
▁ሀይለማርያም	-8.98059
▁አትሌት	-8.98061
▁ተመልክቷል	-8.98104
▁ተቃውሞ	-8.98144
▁ቀጣይ	-8.98175
▁ሰብሳቢ	-8.98285
▁40	-8.98449
▁መጫወት	-8.98513
▁የጠቆሙት	-8.98518
▁በጎ	-8.98575
▁በየአመቱ	-8.98914
▁ፈተና	-8.98946
▁እናመሰግናለን	-8.9899
ሰበር	-8.99035
▁የተጀመረው	-8.99072
▁አደሮች	-8.99211
▁የሚሉት	-8.99504
▁ችግሩን	-8.99595
▁ምእራፍ	-8.99603
▁የህብረተሰብ	-8.99721
▁ምስሎችን	-8.99782
▁የህዳሴ	-8.99868
▁ሰብአዊ	-8.99886
▁ያስፈልጋል	-8.99902
▁ይደረጋል	-8.99919
▁መንግስታዊ	-9.00135
▁ኬንያ	-9.00137
ሶከር	-9.00184
▁ነገሮች	-9.00303
▁O	-9.00391
▁ሌላው	-9.00415
ቸውን	-9.00467
▁አውሮፕላን	-9.00487
▁ረዳት	-9.00576
▁ተገቢ	-9.006
▁ካሳ	-9.00621
▁እንዲሆኑ	-9.01054
▁ገና	-9.01158
▁አንስቶ	-9.01299
▁ተጠቁሟል	-9.01369
▁ይዘው	-9.01391
▁ኮሚሽኑ	-9.01541
▁ለመቆጣጠር	-9.01549
▁የህወሀት	-9.016
▁ትራንስፖርት	-9.0161
▁ቴሌግራም	-9.01615
▁ላለፉት	-9.01617
▁ልክ	-9.0184
▁ቀውስ	-9.02161
▁ወጥቶ	-9.02365
▁with	-9.02412
▁ሳቢያ	-9.0242
▁ይወዳጁን	-9.02536
▁ይቀላቀሉ	-9.02537
▁2008	-9.02579
▁ማህበራት	-9.02706
▁ሰሞኑን	-9.02779
ባት	-9.02798
▁ኮርፖሬሽን	-9.02802
▁ለመገንባት	-9.02914
▁29	-9.02951
▁ትላንት	-9.03131
▁ይላሉ	-9.03138
▁ላ	-9.03178
12	-9.03193
▁ኮሪያ	-9.03207
▁ራሱን	-9.03217
▁መሰረተ	-9.03339
▁ህገወጥ	-9.03453
ግ	-9.03513
▁Bunna	-9.0356
30	-9.03643
▁ካርድ	-9.03825
▁መነሻ	-9.03881
▁ግንዛቤ	-9.03893
▁የሚኖሩ	-9.03957
▁as	-9.03983
▁ማክሰኞ	-9.04003
▁ክልላዊ	-9.04051
▁ደርሷል	-9.04075
▁ይጎብኙ	-9.0409
▁የኦሮሞ	-9.04109
▁ዳንኤል	-9.04156
▁ቀድሞ	-9.04328
▁የትራንስፖርት	-9.04345
▁የቤት	-9.04381
▁የመንገድ	-9.04403
▁ጉዳዩን	-9.04445
▁ተከታታይ	-9.04472
▁ወሮ	-9.04487
ዊ	-9.04736
▁ስለዚህ	-9.04743
▁ሳምንታት	-9.04868
ዋል	-9.04891
▁መሆኑም	-9.05072
▁የመሬት	-9.05225
▁ለሁለት	-9.05238
▁የተሟሉ	-9.05449
▁ዩናይትድ	-9.05458
▁ትስስር	-9.05459
▁አነስተኛ	-9.05517
▁የሚሆኑት	-9.05548
ራ	-9.05598
▁2009	-9.05701
ኢትዮጵያ	-9.05958
▁ትውልድ	-9.06069
ላ	-9.06167
▁ብድር	-9.06222
▁የሀይል	-9.0626
ሪ	-9.0636
▁በመተባበር	-9.06492
▁ተከላካይ	-9.06604
▁ለሪፖርተር	-9.06813
▁ማድረጉን	-9.06914
▁ኢትዮ	-9.06982
▁መመሪያ	-9.07
▁የቻይና	-9.07104
▁መድረሱን	-9.07179
▁ልጆች	-9.0731
▁የጠቅላይ	-9.0732
K	-9.07363
ተባበሩት	-9.0741
▁አሰልጣኞች	-9.07698
▁ቢቢሲ	-9.07707
▁በመሆናቸው	-9.07782
▁ሰአታት	-9.07999
▁ሶስተኛ	-9.08051
▁አጠናክሮ	-9.08292
▁የቡድኑ	-9.08338
▁አማካይ	-9.08528
▁ጠቅላላ	-9.09109
ነው	-9.09196
▁fro	-9.09422
▁ባለድርሻ	-9.09451
▁ሰልፍ	-9.09669
▁ቀላል	-9.09792
▁ሚኒስትሯ	-9.10067
▁ገለፀ	-9.10087
▁ለመቀነስ	-9.10174
ቡድኑ	-9.10257
▁ብዬ	-9.10312
▁አርብ	-9.10505
▁ግልፅ	-9.1053
▁ዜናዎችን	-9.10588
▁ለሙሉ	-9.1059
▁ዳዊት	-9.10701
▁ህዝባዊ	-9.10897
▁ይናገራሉ	-9.1091
2010	-9.1092
▁ሳይጠብቁ	-9.10983
▁የክልል	-9.11243
▁በከተማዋ	-9.11261
▁የሚችሉ	-9.11392
▁የተደረገው	-9.11398
▁የሚያስችሉ	-9.11543
▁አስገንዝበዋል	-9.11558
▁የኮቪድ	-9.11594
▁በዘርፉ	-9.11607
▁ፌዴሬሽኑ	-9.11673
ሳ	-9.11799
▁ሳሙኤል	-9.11868
▁ስ	-9.11927
▁ከመንግስት	-9.11929
▁መሰረታዊ	-9.11964
▁ያደርጋል	-9.12031
▁እየሰሩ	-9.1208
▁ፖለቲካዊ	-9.12126
▁መብቶች	-9.12169
▁ታሪካዊ	-9.12197
▁ዘጠኝ	-9.12229
▁ንቅናቄ	-9.12382
▁ይላኩ	-9.12486
▁ጋዜጣዊ	-9.12525
ቹ	-9.12551
▁ትግል	-9.12719
▁ክብር	-9.12738
▁ህይወታቸው	-9.12856
▁አስተባባሪ	-9.12998
8	-9.13007
▁ፋብሪካ	-9.13238
▁የተለየ	-9.13306
▁የሚደረገው	-9.13318
▁ብልጫ	-9.13325
▁በበኩሉ	-9.13328
▁የተነሳ	-9.13378
▁ክፍተት	-9.13605
11	-9.13632
▁መኖሪያ	-9.13675
▁የተፈጥሮ	-9.13706
▁ሁለተኛው	-9.13772
▁የከፍተኛ	-9.13905
▁እያደረጉ	-9.13927
▁ይላል	-9.14082
▁ምርምር	-9.14344
▁የምርመራ	-9.14445
▁ተመስገን	-9.14633
▁የጨዋታ	-9.14748
ተ	-9.14794
▁አንቀፅ	-9.14916
▁ዋነኛ	-9.14948
▁አረቢያ	-9.14962
▁ለመጀመሪያ	-9.1563
▁መቻሉን	-9.15669
▁ጥላሁን	-9.15863
የፋና	-9.1607
▁ገብቷል	-9.1614
▁አብርሀም	-9.16163
▁ኩንታል	-9.16273
▁ሀገራቸው	-9.16463
▁በሶስት	-9.16656
▁ፀጥታ	-9.16669
▁ከተማን	-9.16705
▁ናት	-9.16774
▁በጥሩ	-9.16815
▁ተቀባይነት	-9.16855
▁የተገኘው	-9.16885
▁የሚሆን	-9.16952
▁ይቻላል	-9.16953
▁ተብለው	-9.16992
▁እጅ	-9.17001
▁በመስራት	-9.17007
14	-9.17018
▁በህዝብ	-9.17066
▁ስለሆነ	-9.17264
▁የኢንዱስትሪ	-9.17281
▁ላይም	-9.173
▁አማካሪ	-9.17378
▁በቀላሉ	-9.17573
▁ተጠቃሚነት	-9.17733
▁በመጪው	-9.17783
▁አረጋግጠዋል	-9.17853
▁እንዳሉ	-9.17955
▁ሆሳእና	-9.1799
▁ግንባር	-9.18052
▁እን	-9.18064
▁ሰሜን	-9.18104
▁ምስጋና	-9.18143
▁ሽመልስ	-9.18348
▁የቆየው	-9.18438
▁ሲባል	-9.18461
▁የሚለውን	-9.18463
▁ቅሬታ	-9.18474
▁500	-9.18491
7	-9.18522
▁የአስቸኳይ	-9.1854
▁የሚገኝ	-9.1867
▁ዜጎችን	-9.18741
▁የክለቡ	-9.18803
▁ችለዋል	-9.18924
▁መግባባት	-9.18961
▁100	-9.19299
▁ልማትና	-9.19399
▁ተጠርጣሪዎች	-9.19559
▁አዋጁ	-9.19734
▁የግንባታ	-9.19961
▁ጎንደር	-9.20095
▁ኢትዮጵያዊ	-9.20394
▁ነዋሪ	-9.20415
▁ታከለ	-9.2052
▁ከአለም	-9.20623
▁የሚባል	-9.20747
▁ማሸነፍ	-9.20818
▁አንደኛ	-9.20903
ከፌስቡክ	-9.20927
▁ገፃቸው	-9.20966
▁አገራዊ	-9.21109
▁የኢትዮጵያን	-9.21154
▁ፀጋዬ	-9.21162
▁ተሾመ	-9.21182
▁ዳኛ	-9.21268
▁የአካባቢው	-9.21311
▁አርባምንጭ	-9.21313
▁ችግሩ	-9.21323
▁መልሶ	-9.21593
▁ማቆያ	-9.21659
▁ምርጥ	-9.21708
▁ምሁራን	-9.21863
▁ጉዳዩ	-9.21952
▁በጨዋታው	-9.21968
▁ሀሰን	-9.22044
▁ኤምባሲ	-9.2212
▁መንገዱ	-9.22175
▁ኢንተርናሽናል	-9.2224
▁የሚቆጠሩ	-9.22257
▁ማሀበር	-9.22334
▁ባሉ	-9.22337
▁ጉባኤው	-9.22342
▁በተደረገ	-9.22349
▁አበራ	-9.22421
▁ወደፊት	-9.22738
▁በተገኙበት	-9.22781
▁የሚያደርግ	-9.23098
▁አግባብ	-9.23144
▁የጊዜ	-9.23291
▁የታላቁ	-9.23331
እንዲሁም	-9.23366
▁ሁኔታዎች	-9.23377
▁ካለው	-9.23518
▁ዘ	-9.23594
▁እንደሆኑ	-9.2365
▁አስቀድሞ	-9.2366
▁ሀብታሙ	-9.23678
▁ለመሆን	-9.23695
▁በሰሜን	-9.23794
▁ፓርክ	-9.238
▁የፋይናንስ	-9.239
▁ፕሬዚዳንቱ	-9.23971
▁ሆነዋል	-9.23982
▁እንዲቀጥል	-9.2401
▁እንደሚገባም	-9.24141
አሁን	-9.24166
▁እነዚህን	-9.24309
▁የወንጀል	-9.24336
▁አብሮ	-9.24345
▁ፈጠራ	-9.24357
▁ዳኞች	-9.24477
▁ተገኝተዋል	-9.24491
▁ቅድሚያ	-9.24505
▁ጄኔራል	-9.24539
▁ፀሀፊ	-9.24554
▁ይችላሉ	-9.24567
▁በሀዋሳ	-9.24707
▁የምክር	-9.24763
▁ጥራት	-9.24808
▁የግብፅ	-9.24875
▁ለምን	-9.24961
▁ራሳቸውን	-9.24987
▁መጀመሪያ	-9.25096
▁አቅርቧል	-9.25111
▁ምክንያቶች	-9.25241
▁በዋናነት	-9.25286
▁የገበያ	-9.2532
9	-9.25327
▁በመግባት	-9.25567
▁እንደሚደረግ	-9.25579
▁ገብተዋል	-9.25589
2013	-9.25905
▁ወንዝ	-9.2603
▁ስህተት	-9.26278
▁ኢትዮጵያዊያን	-9.26538
ዘወትር	-9.26612
▁ሀይሌ	-9.26679
▁ከክለቡ	-9.26705
▁ምሽት	-9.26833
▁ግንባታው	-9.26858
▁ዝናብ	-9.26994
▁አስቸኳይ	-9.27052
▁is	-9.27077
▁የበጀት	-9.27188
▁ቶን	-9.27202
▁ሚንስትር	-9.27257
▁በማቅረብ	-9.27295
▁አደባባይ	-9.27308
▁ብዛት	-9.27383
▁መሆኗን	-9.27457
▁በመ	-9.27556
▁ዝውውር	-9.27654
▁የለውጥ	-9.27661
▁መሳሪያዎች	-9.27801
▁አሊ	-9.27937
▁እንዲወጡ	-9.27947
▁ወገን	-9.27963
▁ለመቅረፍ	-9.28014
▁ደንብ	-9.28072
▁ፖሊሲ	-9.28073
▁ጉሙዝ	-9.28141
▁በሽታ	-9.28157
▁አፈ	-9.28293
▁አስቸጋሪ	-9.283
▁እንደሚሰራ	-9.2834
▁አሸናፊነት	-9.28457
▁ያለበት	-9.28689
▁የተያያዘው	-9.28796
▁ዋናው	-9.28981
▁እንዳላቸው	-9.29062
▁መስፍን	-9.29109
▁የዋጋ	-9.29112
▁በመፍጠር	-9.2917
▁ሀሙስ	-9.29182
▁ያደረጉ	-9.29291
▁የሆነውን	-9.29386
▁እንደሚያደርግ	-9.2939
▁አለማየሁ	-9.29409
▁በቀጣይም	-9.29471
▁ባለሙያ	-9.29484
▁የተባለ	-9.29499
▁መግለጫው	-9.29526
▁የሚደረግ	-9.29555
▁ወታደሮች	-9.2957
▁በትምህርት	-9.2958
▁ተከትሎም	-9.29592
▁ግለሰብ	-9.29653
▁ኤርትራ	-9.29685
▁የሚውል	-9.29686
▁እየጨመረ	-9.29723
▁ፅሁፍ	-9.29724
▁በህገ	-9.29792
▁ለማቅረብ	-9.2989
▁ግምት	-9.29904
▁ሁሉንም	-9.29965
▁ዴኤታ	-9.29985
▁የተያዙ	-9.30053
▁ማሳያ	-9.30067
▁አሰልጣኙ	-9.3019
▁የተገለፀው	-9.30307
▁ህወሀት	-9.3034
▁ግብረ	-9.30383
▁ብርሀን	-9.30398
▁እንደሚያስፈልግ	-9.30693
▁በትኩረት	-9.30743
▁መረጋጋት	-9.30749
▁ያሉትን	-9.30807
ነ	-9.30816
▁አስራ	-9.30834
▁እንደሚቀጥል	-9.30857
▁ለሀገር	-9.30878
▁ማረፊያ	-9.3089
▁የመስመር	-9.30899
▁በሰጠው	-9.30933
13	-9.30947
▁በመጀመሪያው	-9.31016
▁የሚሰሩ	-9.3109
▁እአአ	-9.31131
▁ሀብረት	-9.31134
▁መጀመሩን	-9.31145
▁ውድድሩ	-9.31199
እንደ	-9.31298
▁በጉዳዩ	-9.31334
t	-9.31338
▁በተሻለ	-9.31367
▁እንደሚችሉ	-9.31406
▁በረከት	-9.3147
▁የተ	-9.31663
▁811	-9.31705
18	-9.31728
▁ይሄ	-9.31765
▁ሚዲያ	-9.31769
▁ካለ	-9.31792
▁የቅድመ	-9.31895
2009	-9.31937
▁እውን	-9.31938
▁በመግለጫው	-9.31977
▁በሚደረገው	-9.31978
▁ለማካሄድ	-9.32049
▁ገደብ	-9.32076
▁ብሎም	-9.32243
አም	-9.32402
▁እድሜ	-9.32431
▁የአካል	-9.32586
▁60	-9.3263
▁ለማምጣት	-9.3269
▁የተገኙት	-9.32704
▁ምክክር	-9.32726
50	-9.32792
▁ዜጋ	-9.32807
▁የባህል	-9.33073
▁አኳያ	-9.33097
▁በመያዝ	-9.33256
▁ካሉ	-9.33279
▁እዚህ	-9.33319
y	-9.33512
▁የሀገሪቱን	-9.33532
▁ስዩም	-9.33619
▁በማሸነፍ	-9.33735
▁በጠቅላይ	-9.33857
▁የገለፀው	-9.33927
▁ሌሎችም	-9.33971
▁ግብርና	-9.34001
▁አደረጃጀት	-9.34017
▁መድሀኒት	-9.34083
▁ሁለቱም	-9.34103
▁ጊዜያዊ	-9.34178
▁ሰጥቶ	-9.3421
▁የቆየ	-9.34304
▁ዝቅተኛ	-9.34499
▁ምርጫው	-9.34544
▁ባለፈም	-9.34561
▁የኮሮናቫይረስ	-9.34611
▁እንዲያገኙ	-9.3464
▁የሚሰጥ	-9.34643
th	-9.34653
ዋን	-9.34687
▁ለአለም	-9.34886
ችው	-9.34899
▁ትግራይ	-9.34907
fanatelevision	-9.3492
▁ዘውዴ	-9.3492
▁የእግር	-9.34953
▁ተልእኮ	-9.35047
▁ቋንቋ	-9.35145
▁ህንፃ	-9.35194
▁ዞኖች	-9.3528
▁ስነስርአት	-9.35284
▁የገቢ	-9.35314
▁በሱዳን	-9.35338
▁ሀሳቦች	-9.35416
የአዲስ	-9.35447
▁ግድያ	-9.35703
▁ጠባቂው	-9.35711
ፈጣን	-9.35716
▁ተገኝተው	-9.35796
▁አማራ	-9.35819
▁አስተላልፈዋል	-9.35921
▁ነኝ	-9.35982
▁የመከላከል	-9.35982
▁ፕሪሚየር	-9.35984
▁ማንኛውም	-9.36057
en	-9.36083
▁እቃዎች	-9.36143
▁ጥፋት	-9.36145
▁ኮንስትራክሽን	-9.36151
▁ለማሳካት	-9.36165
▁እንዲሰሩ	-9.36317
▁በተለያየ	-9.36339
▁በባህር	-9.36379
▁በሊጉ	-9.36614
▁ጠቁሟል	-9.36788
▁የመገናኛ	-9.36935
▁ተገቢውን	-9.36977
▁ለሚገኙ	-9.36986
▁ነጥቦች	-9.37005
▁የነዳጅ	-9.37087
▁ሁሴን	-9.37203
▁በሚ	-9.3721
▁የሽብር	-9.37298
▁ለማድረስ	-9.3738
▁ተወካይ	-9.37398
▁የመረጃ	-9.37527
▁ቢያንስ	-9.37541
▁እንዲያደርጉ	-9.37548
▁የበላይነት	-9.37575
▁የሚሉ	-9.37632
▁ረቡእ	-9.37658
▁ሸዋ	-9.37775
▁ተሳታፊዎች	-9.37809
▁ቢራ	-9.37809
▁ብለን	-9.37962
▁አለመሆኑን	-9.37971
100	-9.38079
▁ቴዎድሮስ	-9.38299
▁ጣቢያዎች	-9.38331
▁የባህር	-9.38358
▁የፖሊስ	-9.38403
▁ሳይንስ	-9.38529
በአሁኑ	-9.38535
▁የተባሉ	-9.38558
ir	-9.38575
▁የተገኘባቸው	-9.38617
▁የጀመረው	-9.38734
▁ሚኒስቴሩ	-9.38899
▁ለጎን	-9.38953
▁ሚኒስትሮች	-9.38999
▁እያ	-9.39
▁ምክንያቱም	-9.39122
▁በትናንትናው	-9.39249
▁ጭማሪ	-9.39295
▁ደስ	-9.39332
▁ውጤቶች	-9.39449
የዜና	-9.39453
com	-9.39507
▁በማሰብ	-9.39515
▁ዘርፉ	-9.39583
▁ከሶስት	-9.39622
▁ቃለ	-9.39651
▁የማይ	-9.39657
▁ፀረ	-9.39662
▁ተቋሙ	-9.39719
በሌላ	-9.39731
▁ተጫዋቹ	-9.39758
▁Giorgis	-9.39868
▁ከአፍሪካ	-9.40046
▁በሰላማዊ	-9.40125
▁የሚካሄደው	-9.40136
▁አስታውሰዋል	-9.40165
▁ሞት	-9.40181
16	-9.40213
▁የስደተኞች	-9.40259
▁ፖለቲካ	-9.40263
ተንቀሳቃሽ	-9.40291
▁የኢትዮ	-9.40482
▁በአዳማ	-9.40647
▁ቀበሌ	-9.40938
▁እንቅስቃሴዎች	-9.40962
▁አዳራሽ	-9.40977
▁ፍትሀዊ	-9.41282
▁ለማሻሻል	-9.41327
▁የሚሆነው	-9.41411
▁ኮከብ	-9.41714
▁የሰጡት	-9.41882
▁መሀል	-9.41901
▁ነዳጅ	-9.41946
▁አለሙ	-9.41984
25	-9.42085
▁ቤታቸው	-9.42165
▁ኦሊምፒክ	-9.4234
▁ከሚገኙ	-9.42427
▁ሲያደርግ	-9.42431
▁በቀን	-9.4249
ሰ	-9.42496
▁ባንኮች	-9.425
▁ግድቡ	-9.42573
▁ፅቤት	-9.42632
▁የተደረገ	-9.42695
▁በትብብር	-9.42821
▁ከሜዳ	-9.42889
▁እርምጃዎች	-9.42916
▁በኋላም	-9.43014
▁ክፍት	-9.43053
▁200	-9.43096
▁በየነ	-9.43177
▁ክለቡን	-9.43184
▁31	-9.43246
▁ኮሙዩኒኬሽን	-9.43288
ባለፈው	-9.43434
▁አረብ	-9.43447
▁የምስራቅ	-9.43484
ረ	-9.43569
▁የተሰማሩ	-9.43616
▁የመሰረተ	-9.43691
▁የማስከበር	-9.43741
▁አባይ	-9.43798
▁ኤልያስ	-9.43809
▁በብሄራዊ	-9.43857
▁የስነ	-9.43915
▁ማእከላዊ	-9.43932
▁የማ	-9.43952
▁አዳነች	-9.43997
▁ባሉት	-9.44023
▁ስኬታማ	-9.44169
▁ማድረጋቸውን	-9.44388
▁የሁለት	-9.44446
▁አካሄድ	-9.44539
▁አጀንዳ	-9.44556
▁ምንዛሪ	-9.4464
እረፍት	-9.44652
▁ለመጫወት	-9.44698
▁ሲሳይ	-9.44781
▁በክለቡ	-9.44789
▁ደም	-9.448
c	-9.44802
▁መሪነት	-9.44804
▁ማሞ	-9.44825
▁ፍቃድ	-9.44922
▁ጋዜጠኞች	-9.45018
▁በራሱ	-9.4511
▁ግማሽ	-9.4515
▁አስ	-9.45195
ሎ	-9.45199
▁በማህበራዊ	-9.45379
▁ያሬድ	-9.45566
▁ሽግግር	-9.45596
▁የከተማዋ	-9.45766
▁አዳነ	-9.45827
▁ቀጥሎ	-9.45859
▁ብሄረሰቦችና	-9.45899
▁አባቶች	-9.46013
▁ተናገሩ	-9.46019
▁አትሌቲክስ	-9.46029
▁ባህላዊ	-9.46032
▁ኦሮሚያ	-9.46039
ለዋልታ	-9.46043
▁በፌዴራል	-9.46135
▁ያላትን	-9.46385
ካ	-9.46404
ሊ	-9.46406
▁ኢንስቲትዩት	-9.46417
▁አአ	-9.46546
▁ፍቃዱ	-9.4657
▁እየተከናወነ	-9.46602
▁አመታዊ	-9.46628
▁አላቸው	-9.46718
ኖ	-9.46766
▁መስኮች	-9.46797
▁እያለ	-9.46806
▁የማድረግ	-9.46818
▁በአንፃሩ	-9.46919
▁የስልጣን	-9.47033
▁Addis	-9.47177
▁was	-9.47184
▁መንፈስ	-9.47192
▁አጠቃቀም	-9.47201
▁የሚያ	-9.47206
▁ከነበረው	-9.4722
▁መላኩ	-9.4723
▁ፕሮጀክቱ	-9.47521
▁በምስራቅ	-9.47531
▁አካዳሚ	-9.47579
▁የተገኙ	-9.47589
▁ሀዳር	-9.47624
▁ወልዋሎ	-9.47737
▁የዜና	-9.47758
▁ማቅረብ	-9.47774
▁በዘላቂነት	-9.47782
▁ፕሬስ	-9.47789
▁ኡማ	-9.47791
▁ተጠናቆ	-9.47967
▁መግባት	-9.4801
ዳ	-9.48016
▁ማስረጃ	-9.48102
▁የከፋ	-9.48156
▁አደሩ	-9.48159
▁after	-9.48163
▁ማጠናከር	-9.48164
ነጥብ	-9.48168
▁ለመደገፍ	-9.4817
▁ከቫይረሱ	-9.48314
ቅ	-9.48319
▁የሚመራው	-9.4833
▁እድሎች	-9.48352
▁ማሀበረሰብ	-9.48387
▁ቀሪ	-9.48432
▁ቦርዱ	-9.48472
ይህ	-9.48527
▁ኢ	-9.4853
▁እገዛ	-9.48564
▁ሰጪ	-9.48697
▁ተናግሯል	-9.48708
0900	-9.48883
▁ሙያ	-9.48946
▁ባካሄደው	-9.48957
▁በአሉ	-9.48985
▁ግጭቶች	-9.49007
▁ግምገማ	-9.49119
▁የዚህ	-9.49158
▁ርብርብ	-9.49174
▁መናገራቸውን	-9.49214
▁ሳህለወርቅ	-9.49352
▁ምእራብ	-9.49384
▁ሶስቱ	-9.49453
▁በሚገባ	-9.49586
▁በቅርብ	-9.49632
▁ቀርበው	-9.49777
▁በግልፅ	-9.49922
▁ግብሩ	-9.49931
▁ማረጋገጥ	-9.4995
▁አቀባበል	-9.4999
▁በንግድ	-9.50029
▁መምህር	-9.50091
▁አንዳርጋቸው	-9.50176
witter	-9.50234
▁ሙከራዎች	-9.50285
▁ፍፃሜ	-9.50343
wwwyoutubecom	-9.50349
▁ደሀንነት	-9.50357
▁ተሽከርካሪዎች	-9.50427
▁የአገሪቱን	-9.50666
▁የአለማችን	-9.50673
▁ክልሉ	-9.50691
▁ታላቅ	-9.50724
24	-9.50787
▁የኤርትራ	-9.50814
▁ሀይለ	-9.50836
▁ማጣሪያ	-9.50927
▁ይመስላል	-9.50953
▁will	-9.50971
▁ማለትም	-9.51067
▁ባሳለፍነው	-9.51108
▁ቤተሰቦች	-9.51205
▁ምድር	-9.51237
▁የሌለው	-9.51242
▁ይገልፃሉ	-9.51259
▁ተሰማ	-9.51337
ተያያዘው	-9.51363
▁ማጥቃት	-9.5137
▁ከሰሞኑ	-9.51417
▁መጠበቅ	-9.51433
2008	-9.51491
▁እንደርታ	-9.51495
▁ገዱ	-9.51586
▁መለስ	-9.51655
▁ህይወታቸውን	-9.51661
▁የሚሰጠው	-9.51698
▁እንዲመለሱ	-9.51775
▁በአንዳንድ	-9.51842
▁የቻለው	-9.51876
▁ግዙፍ	-9.52001
▁ተማሪዎችን	-9.52033
▁ህብረተሰብ	-9.52203
▁ተፈጥሮ	-9.52231
▁ያለመ	-9.52242
▁ስኬት	-9.52343
▁ሲያደርጉ	-9.52398
▁የቡና	-9.52407
▁ከዚያ	-9.52432
▁ካለፈው	-9.52501
▁የቴክኒክ	-9.52513
▁ባለበት	-9.52525
▁ማሳደግ	-9.52586
▁ለመግታት	-9.52591
▁ድንቅ	-9.52608
▁የመልካም	-9.52684
▁መኖሩን	-9.52756
▁ለማከናወን	-9.52805
▁ከእነዚህ	-9.52821
በኢትዮጵያ	-9.52839
▁ይሁንና	-9.52878
▁ኤ	-9.52902
▁ኤፍሬም	-9.52903
▁ስፍራዎች	-9.52965
▁እርስ	-9.53
▁የቅዱስ	-9.53048
▁ተጨዋቾች	-9.53105
▁ሚካኤል	-9.5316
▁መድን	-9.53168
▁ኢነርጂ	-9.53205
▁Ethiopian	-9.53207
▁ፉክክር	-9.53266
በዚህ	-9.53349
▁ኢህአዴግ	-9.5339
▁ፍቅር	-9.53397
▁ይሆን	-9.5341
▁መቆጣጠር	-9.53414
▁ደስተኛ	-9.53416
▁የለውም	-9.53428
▁በማስገባት	-9.53523
▁ከወዲሁ	-9.53624
▁ወጣቱ	-9.53644
▁አሰላለፍ	-9.53647
▁ተጠያቂ	-9.53822
▁ምጣኔ	-9.53849
▁ሪፖርተር	-9.53896
▁ኳሶች	-9.53908
er	-9.53911
▁ሽረ	-9.53967
▁ትረምፕ	-9.53977
▁ለፍርድ	-9.54
▁ለጋዜጠኞች	-9.54048
▁ፕሬዚደንት	-9.54083
▁የሰሜን	-9.54084
▁ተከላ	-9.54222
አ	-9.54249
▁በዋና	-9.54268
▁ለህግ	-9.5427
▁የብድር	-9.54272
▁በእርስ	-9.54332
▁ሁከት	-9.54362
▁መምሪያ	-9.54392
▁በጉዳት	-9.54665
▁ዲ	-9.54675
▁ቁልፍ	-9.5469
ሲ	-9.54719
▁አባተ	-9.5475
▁በቻይና	-9.54751
▁ሚያዚያ	-9.54785
▁ቆይተዋል	-9.54787
▁የሚገኘውን	-9.54885
ባ	-9.54955
▁32	-9.54976
▁በሰው	-9.55036
wwwfanabccom	-9.55083
▁ሲነፃፀር	-9.55084
▁ኢንፎርሜሽን	-9.55108
▁ግዜ	-9.55163
▁ተካሂዷል	-9.55195
▁at	-9.55251
▁ፍትህ	-9.5533
▁በግብፅ	-9.55375
▁ከትናንት	-9.55412
▁ማእከላት	-9.55532
▁ግብአት	-9.55538
▁ሞገስ	-9.55587
▁80	-9.55619
▁መኖራቸውን	-9.55658
▁ይካሄዳል	-9.55717
▁መድረኩ	-9.55918
▁በቀጣዩ	-9.56117
▁በማ	-9.56134
▁ከደቡብ	-9.56155
▁ማለዳ	-9.56183
▁ሶከር	-9.56235
▁ዙርያ	-9.5631
▁በአመት	-9.56332
▁የፀረ	-9.56545
▁ማስቆጠር	-9.56605
▁ሙሉጌታ	-9.56628
▁እንዲደርስ	-9.56649
▁አስተዳዳሪ	-9.56803
▁ለሌሎች	-9.5682
▁በውይይቱ	-9.56914
▁የሚያደርጉት	-9.56922
▁ማሀበራዊ	-9.57012
▁የመስኖ	-9.57047
▁የተመሰረተ	-9.57053
▁እጣ	-9.5708
▁የኢህአዴግ	-9.57094
▁ፓርኮች	-9.5715
▁አሸንፏል	-9.57154
▁ታሀሳስ	-9.57178
▁ያለፈ	-9.572
▁ነን	-9.57333
▁ፓርቲው	-9.57434
▁ስልክ	-9.57449
▁ኮሎኔል	-9.57486
▁አሰጣጥ	-9.57499
ልኝ	-9.57502
▁ለረጅም	-9.5759
▁አልነበረም	-9.57645
በመሆኑም	-9.57767
▁አማኑኤል	-9.57786
▁በተግባር	-9.57888
▁ትርጉም	-9.57895
▁የጎላ	-9.5791
▁መምህራን	-9.58004
40	-9.58035
▁ኢሳያስ	-9.58086
▁ሙስና	-9.58098
▁የሚገቡ	-9.58146
▁ዩኒቨርስቲ	-9.58179
▁የተካሄደው	-9.58192
▁ባንኩ	-9.58268
▁ሀያ	-9.58336
▁his	-9.58406
▁ወጥቷል	-9.58436
▁ቤቶችን	-9.58532
▁ረጅም	-9.58591
▁ገብተው	-9.58742
▁በየጊዜው	-9.58749
▁መጠናቀቁን	-9.58814
▁ከተማዎች	-9.58819
ቴሌግራም	-9.58821
▁ኤል	-9.58861
▁መቀጠል	-9.58973
▁are	-9.58992
▁በተያዘው	-9.59106
▁እንዲኖር	-9.59135
▁በህገወጥ	-9.59216
▁ቀርቦ	-9.5935
▁ውድቅ	-9.59393
▁የፓርቲው	-9.59426
▁አካባቢው	-9.59447
▁ሽያጭ	-9.59462
▁የውጪ	-9.59478
ዶክተር	-9.5952
▁የአ	-9.59584
▁እንደመሆኑ	-9.59622
▁የዴሞክራሲ	-9.5963
▁መውጣት	-9.59791
▁ደካማ	-9.59815
▁አማካይነት	-9.59923
▁ለሶስት	-9.59933
ብን	-9.59954
▁እንዲያደርግ	-9.59967
▁በስቲያ	-9.60052
▁እንደሚካሄድ	-9.6017
ሬ	-9.60183
▁ማርያም	-9.602
▁የብልፅግና	-9.60221
▁ሰ	-9.60278
▁ሲካሄድ	-9.60285
▁በተለየ	-9.60293
▁ለይቶ	-9.60321
▁300	-9.60442
▁በመላው	-9.60452
▁ጎሎች	-9.60485
▁እንዳስታወቁት	-9.60497
▁ወቅትም	-9.60539
▁ጠይቋል	-9.60549
▁በብዙ	-9.6059
▁ያሳያል	-9.6072
▁በስተቀር	-9.60721
▁እንደነበረ	-9.6076
▁በነገው	-9.60806
▁በጤና	-9.60915
▁ሊቀ	-9.60917
▁ተጀምሯል	-9.60933
ዱ	-9.60974
▁መቆየቱን	-9.60984
▁በሁለቱም	-9.60986
▁ዋልታ	-9.61109
▁መመለስ	-9.61171
▁በብዛት	-9.61184
▁ፋብሪካዎች	-9.61208
▁ማመንጫ	-9.6131
ልን	-9.61345
▁የበጎ	-9.6136
▁የሚያደርገው	-9.61373
▁ህመም	-9.61375
▁ትራንስፎርሜሽን	-9.61427
▁ብቸኛ	-9.61448
▁የሚያሳይ	-9.61491
▁በእጅጉ	-9.61616
ደርስዎ	-9.61655
▁አክለዋል	-9.61779
▁አስተሳሰብ	-9.61831
▁ሂደቱ	-9.61862
▁የመታው	-9.61907
▁የውሳኔ	-9.61945
▁ኮሚሽነሩ	-9.61952
▁በመላ	-9.62201
▁የምድብ	-9.62221
▁ሙላቱ	-9.62298
▁90	-9.62321
▁ተወያይተዋል	-9.62339
▁የውይይት	-9.62372
▁አምራች	-9.62382
▁ሰራተኛ	-9.62428
▁ጉልህ	-9.62519
▁እንዲገቡ	-9.62532
▁በር	-9.62581
▁ሰበታ	-9.62596
▁በሜዳው	-9.62673
▁በውድድሩ	-9.62782
▁2007	-9.62822
▁የተውጣጡ	-9.62837
▁ከሀገር	-9.62846
▁ለአፍሪካ	-9.62903
▁ምዝገባ	-9.62924
▁እንዳልሆነ	-9.62942
▁ኦ	-9.63039
▁በሚካሄደው	-9.63065
▁እንዲሰጡ	-9.63201
▁ገብረ	-9.63216
▁ትልቁ	-9.63235
▁በምን	-9.63358
▁የተሰጠው	-9.63395
ተከላካይ	-9.63431
▁ለመግባት	-9.63438
▁የሚደረጉ	-9.63629
▁በመገኘት	-9.63673
▁የሁለቱን	-9.63782
▁ህጉ	-9.63947
▁ጀማል	-9.63965
n	-9.64007
▁በምእራብ	-9.64016
▁ስራቸውን	-9.64037
▁የባቡር	-9.64175
▁የጥፋት	-9.64178
▁Kidus	-9.64259
▁ያልሆኑ	-9.64295
▁game	-9.6431
▁ተፎካካሪ	-9.64342
▁ያነሱት	-9.64403
▁ኮቪድ	-9.64421
▁ያላት	-9.64487
▁ምህረት	-9.64488
▁አባላትን	-9.64488
▁ስርአቱን	-9.64548
▁ጅፋር	-9.64609
▁ምልክት	-9.64609
▁በከተማ	-9.6461
▁መስክ	-9.64619
▁ይሰራል	-9.64626
▁ማረጋገጫ	-9.64729
▁የሀዋሳ	-9.64757
▁የቴክኖሎጂ	-9.6482
▁የደህንነት	-9.651
▁የደረሰው	-9.65148
▁አብዱል	-9.65158
▁አጋር	-9.65195
▁ውድድሩን	-9.65212
▁እንደሚሉት	-9.65298
▁ኦባማ	-9.65312
▁መገንባት	-9.65316
▁የመጀመርያው	-9.65394
▁ፋይዳ	-9.65414
▁የሊጉ	-9.65466
▁ቢቂላ	-9.65514
▁ብዙም	-9.65546
▁አቤል	-9.65666
▁ተጠቅሞ	-9.65742
ቴ	-9.65786
▁የግንዛቤ	-9.65795
▁የትራፊክ	-9.65813
ፕሪምየር	-9.65814
▁ሲደረግ	-9.65829
▁ታፈሰ	-9.65856
ሀ	-9.65882
ly	-9.65909
▁ትውልደ	-9.65963
▁ሰላምን	-9.65974
▁ኮሌጅ	-9.65988
▁አለብን	-9.66002
▁ማየት	-9.66042
ቼ	-9.66049
▁ስት	-9.66066
▁ከቅርብ	-9.66164
▁ያለባቸው	-9.66224
▁ክርስቲያን	-9.66235
▁ለመውጣት	-9.66239
ዎችን	-9.6624
▁በራሳቸው	-9.6626
▁የምርት	-9.66329
▁ጣልቃ	-9.66468
▁ተጋላጭ	-9.66504
ፕሬዚዳንት	-9.66645
▁ጀምሯል	-9.6665
▁Ababa	-9.6669
▁የሽግግር	-9.66716
▁ቡናን	-9.6679
▁ዩኒቨርሲቲዎች	-9.66792
▁ዴሞክራሲ	-9.66808
▁ይቅርታ	-9.66829
▁ሽማግሌዎች	-9.66842
23	-9.66858
▁አልፏል	-9.66885
▁ከዚህም	-9.66929
▁መምጣቱን	-9.66932
▁አብረው	-9.66936
▁መኖር	-9.6697
▁አገልግሎቶች	-9.67072
2006	-9.67091
▁የሚሰራ	-9.67232
▁መደረጉ	-9.67249
▁ትክክለኛ	-9.67334
▁ርእስ	-9.67414
▁ፎረም	-9.67422
▁በማጠናከር	-9.67469
▁ችግኝ	-9.67479
▁በመውሰድ	-9.67491
▁በአዲሱ	-9.67563
▁ተፈራ	-9.67645
▁ለመጠቀም	-9.67657
▁በርስ	-9.677
▁የላቀ	-9.677
▁ወልቂጤ	-9.67736
▁በሆነው	-9.67799
2007	-9.67804
▁አልባ	-9.67867
▁የተቀናጀ	-9.67919
▁በቀል	-9.67923
▁የድርጅቱ	-9.67957
▁አስቻለው	-9.68008
▁የኬንያ	-9.68013
▁ታላቁ	-9.68077
corporat	-9.68121
▁ከጠቅላይ	-9.68125
▁have	-9.6813
▁እሴት	-9.68143
ሱ	-9.68157
▁ቀይ	-9.68228
fanabroadcasting	-9.68361
▁ለማቋቋም	-9.6843
▁ከስምምነት	-9.68448
▁ሽፋን	-9.68498
▁ዘመኑ	-9.68542
ሜ	-9.68568
▁የጠቆመው	-9.6861
▁ተንቀሳቃሽ	-9.68676
▁አስቆጥሯል	-9.68699
▁ስኳር	-9.68733
▁ህዝብን	-9.68787
ትኩስ	-9.6879
21	-9.68846
▁ያለምንም	-9.68872
▁ቅርንጫፍ	-9.68891
▁በልዩ	-9.68892
ሶ	-9.68915
▁እንደሚቻል	-9.68924
ቶች	-9.68994
▁እንዲሰጥ	-9.69082
▁ጠቅሶ	-9.69086
▁እንዲካሄድ	-9.69091
▁ተደጋጋሚ	-9.69106
▁ጨረታ	-9.69162
▁የወጣው	-9.69197
▁ተግባራትን	-9.69269
ኤፍ	-9.69311
▁የሁለትዮሽ	-9.69366
▁የተቋቋመው	-9.69421
▁ያተኮረ	-9.69423
▁ቀርቷል	-9.69445
▁አዛዥ	-9.69493
▁አይዘነጋም	-9.69572
▁መረብ	-9.69606
▁ጉዳዮችን	-9.69618
▁የሲዳማ	-9.69637
▁በመጥቀስ	-9.69677
ምክር	-9.6968
▁መኪና	-9.69689
▁ፈንድ	-9.69779
▁ያደርጋሉ	-9.69816
▁ንጉሴ	-9.69849
▁በግል	-9.69877
▁እንኳ	-9.6992
▁ጥበብ	-9.69967
▁እንግዶች	-9.70088
▁ኢብራሂም	-9.70129
▁በገንዘብ	-9.70142
▁እስር	-9.70148
▁ደ	-9.70246
▁ከዛሬ	-9.7027
▁ከሚመለከታቸው	-9.70331
▁የሊግ	-9.70393
▁ከክልሉ	-9.70445
▁ቤተሰብ	-9.70457
ሚ	-9.70563
▁ማን	-9.70565
▁አየለ	-9.70596
መንግስት	-9.70608
▁ለማስቀጠል	-9.70664
▁የፍትህ	-9.70706
▁ሰኢድ	-9.70721
▁እኩል	-9.7073
▁ያቀረቡት	-9.70777
▁እንደሚሰሩ	-9.70779
▁ተደራሽ	-9.70817
▁አሳስቧል	-9.70847
▁የማህበራዊ	-9.70942
▁ባለስልጣኑ	-9.70979
▁ማለታቸውን	-9.70983
▁ታ	-9.7103
▁አንደኛው	-9.71046
▁ሜጋ	-9.71089
▁በአሉን	-9.71091
▁የአገልግሎት	-9.71111
▁መሆናቸውንም	-9.71117
▁አብዛኞቹ	-9.71259
▁መወሰኑን	-9.71299
▁የጠቀሱት	-9.7131
▁አደር	-9.71379
▁ሽንፈት	-9.71386
▁ብሩክ	-9.7142
▁እስኪ	-9.71468
▁እንዲወጣ	-9.71493
▁አስታውሰው	-9.71543
▁እውቀት	-9.71584
▁ባቡር	-9.71591
▁የብር	-9.716
▁በአራት	-9.71633
▁አደጋው	-9.71664
ኩ	-9.7169
▁ማራቶን	-9.71701
▁ከጊዜ	-9.71723
▁ሶማሊያ	-9.71778
▁ማስተማር	-9.71789
▁ተቀይሮ	-9.71795
▁ስብስብ	-9.71813
▁አጋጣሚዎች	-9.71819
▁ዘር	-9.71931
▁በድምሩ	-9.72038
▁ሀላፊነቱን	-9.72063
▁ግዴታ	-9.7212
2005	-9.72156
▁ለማስጠበቅ	-9.72288
▁መዋቅር	-9.72299
▁ማእረግ	-9.72354
▁goal	-9.72394
▁ለማጠናቀቅ	-9.72402
በትን	-9.72431
▁ሁለንተናዊ	-9.72542
▁ገብቶ	-9.72544
▁መስተዳድሩ	-9.72567
▁የዝውውር	-9.72573
▁ሀዲያ	-9.72659
▁አያሌው	-9.72852
▁በክልል	-9.72863
▁ስሁል	-9.72863
▁ብሄረሰቦች	-9.72878
▁ነጋዴዎች	-9.72893
▁በነፃ	-9.72947
▁ቀጥሏል	-9.73042
▁የቦርድ	-9.73088
▁ተከሳሾች	-9.7309
▁የራሱን	-9.73104
▁ስምምነቱ	-9.7315
▁ተጠቅሷል	-9.73247
▁ሀይማኖት	-9.73263
▁that	-9.73294
▁መስጫ	-9.73332
▁በአብዛኛው	-9.73376
▁የገባው	-9.73405
▁ይቀጥላል	-9.73422
▁side	-9.73424
▁በሴቶች	-9.73427
▁የጉዞ	-9.73531
▁እስራት	-9.73549
▁ወርቅ	-9.73562
▁ክርክር	-9.73581
▁ጋዜጠኛ	-9.73607
▁ሀዘን	-9.73618
▁ወሎ	-9.73662
▁በምርመራ	-9.73666
▁በወቅታዊ	-9.73731
▁የአካባቢ	-9.7376
▁ምክረ	-9.73843
▁ውጤቱ	-9.73847
▁የሚደረገውን	-9.73911
▁ጨዋታዎችን	-9.73935
▁ተከታዮች	-9.7398
▁ተገናኝተው	-9.74058
▁የላቦራቶሪ	-9.7408
▁የተወሰነ	-9.74128
▁እስራኤል	-9.74134
ሌ	-9.74203
▁በመከላከያ	-9.74211
▁ወርቁ	-9.74287
▁የቡድን	-9.74374
▁ወደብ	-9.74378
ጥ	-9.74446
ባለፉት	-9.74475
▁አጨዋወት	-9.74569
▁s	-9.74573
▁አንዷ	-9.74577
▁እንደገና	-9.74588
▁መውሰድ	-9.74655
▁በሀገራችን	-9.74687
▁ባይ	-9.74718
▁400	-9.74806
▁በዘንድሮው	-9.74819
▁ያስችላል	-9.74823
▁አሻራ	-9.74826
▁መርሀግብር	-9.74841
▁አሉታዊ	-9.74847
▁ተያያዥ	-9.74849
▁የውስጥ	-9.74861
▁እንደሚሰጥ	-9.74865
▁ማጣርያ	-9.7493
▁ኤጀንሲው	-9.74982
▁የቀረበ	-9.74996
▁ክስተት	-9.75087
▁ጥገና	-9.75094
▁አገራቸው	-9.7511
▁ሀሰተኛ	-9.75113
▁ለውጭ	-9.75119
▁ኮንጎ	-9.75128
▁ህግን	-9.75145
▁ግቦችን	-9.75235
▁በየደረጃው	-9.75409
ሞ	-9.75485
▁በተ	-9.75489
▁ተቋማትን	-9.75498
▁በሚመለከት	-9.75597
▁መዝገብ	-9.7568
▁መስቀል	-9.75722
▁በኮቪድ	-9.75751
▁ያልሆነ	-9.75788
▁ለሁሉም	-9.75818
▁ለአሜሪካ	-9.75822
▁ገዛኸኝ	-9.75823
▁የክልሉን	-9.75854
▁የበኩሉን	-9.75855
▁ታሳቢ	-9.75855
▁እንዳስታወቀው	-9.75868
▁የተወሰኑ	-9.75913
▁ካላቸው	-9.75948
▁ማድረጉ	-9.76011
▁ኩባንያው	-9.76052
▁ዲግሪ	-9.76078
▁ዝቅ	-9.76162
ላት	-9.76168
▁ባላቸው	-9.76269
ኒ	-9.76289
▁የምን	-9.76309
▁ያለፉትን	-9.76328
▁እድሎችን	-9.76389
ምክትል	-9.76493
▁መላው	-9.76494
▁የድጋፍ	-9.76499
▁ነባር	-9.76544
▁ተጠቃሽ	-9.76638
▁በቅንጅት	-9.76644
▁አስተያየታቸውን	-9.76709
▁ሲሰራ	-9.76818
▁መያዙን	-9.76884
▁ከመረብ	-9.76914
▁የቫይረሱ	-9.76958
▁የሶስት	-9.76962
▁ጀነራል	-9.76973
▁እያደገ	-9.77111
▁መቀነስ	-9.77114
▁የጨዋታው	-9.77148
▁የሙከራ	-9.77195
▁ያስታወቀው	-9.77233
▁ስትራቴጂ	-9.77237
▁ወሰን	-9.77252
▁በአስቸኳይ	-9.7734
▁ታቅዶ	-9.77427
▁መርማሪ	-9.7743
▁የሚመለከታቸው	-9.77445
▁ማለፉን	-9.77453
▁ል	-9.77456
▁ኮማንደር	-9.77469
▁ይሄን	-9.7753
▁የግድቡ	-9.77585
▁መገኘቱን	-9.77632
▁የተገኘ	-9.77668
ለን	-9.77694
▁መጠጥ	-9.77701
▁ጅቡቲ	-9.77717
▁የድንበር	-9.77731
▁ሪፖርቱ	-9.77737
▁ያስረዳል	-9.77738
▁በኬንያ	-9.77746
▁ዋኢማ	-9.77801
▁በአንድነት	-9.77817
▁ህዝቡን	-9.77833
▁የመፍትሄ	-9.77863
በታል	-9.77869
▁በግብርና	-9.77938
▁ዘይት	-9.77949
▁መንስኤ	-9.77951
▁ያድምጡ	-9.77952
▁የሌላቸው	-9.77956
▁የትብብር	-9.77969
▁አብዲ	-9.78048
▁ልውውጥ	-9.78148
▁ጌታሁን	-9.78221
▁ተጠርጥረው	-9.78222
▁መጠናቀቅ	-9.78223
▁እያሉ	-9.7828
▁Adama	-9.78326
▁ከመቶ	-9.78335
▁ቦሌ	-9.78451
▁መሻሻል	-9.78493
▁አያያዝ	-9.78506
▁በመቀጠል	-9.78519
▁ከኮሮና	-9.78551
▁ተሞክሮ	-9.78605
▁በድሬዳዋ	-9.78675
▁እንደሌለ	-9.78694
▁ጥቃቶች	-9.78771
▁እንደሚያደርጉ	-9.78951
▁ታዋቂ	-9.78975
▁ይሆናሉ	-9.79018
ወደ	-9.79091
▁ፅኑ	-9.7911
ዛሬ	-9.79114
▁45	-9.79189
▁መካከለኛ	-9.79215
▁ለስራ	-9.79234
▁ዋት	-9.79293
▁ታጣቂዎች	-9.79431
▁መንግስትና	-9.79458
▁የመጡ	-9.79496
▁35	-9.79517
▁እንደሚጠበቅ	-9.79537
▁ትርፍ	-9.79575
▁እንዲደረግ	-9.79577
ላከው	-9.79585
▁መድረኮች	-9.79587
▁ሌላኛው	-9.79606
▁የሚካሄድ	-9.79622
▁የሜዳ	-9.79658
▁ጌትነት	-9.79733
▁ሰራዊቱ	-9.7978
▁ያገገሙ	-9.79858
▁ድንጋይ	-9.7986
ኮሮናቫይረስ	-9.79864
▁የታሪክ	-9.7989
▁ትንሽ	-9.79893
▁በመጀመሪያ	-9.7995
▁ከቻይና	-9.79966
መ	-9.80026
▁በእለቱ	-9.80065
▁በመለየት	-9.80099
▁ማምረት	-9.80111
ኮ	-9.80116
▁የህገ	-9.80118
▁አያይዘውም	-9.80196
▁ተረጋግጧል	-9.80265
▁ቻምፒዮን	-9.80279
▁በበጀት	-9.80303
▁ገልፆ	-9.80351
▁የሚደርሱ	-9.80381
▁ጥሰት	-9.80384
▁የምርምር	-9.80393
▁እዝ	-9.80429
▁የችግኝ	-9.80444
▁የቱሪዝም	-9.80462
▁አጭር	-9.80521
▁ጠቀሜታ	-9.80559
▁ግዥ	-9.80621
▁ዘርፈ	-9.8065
▁ለመንግስት	-9.80657
▁አጥቂው	-9.80691
▁ከስራ	-9.80785
▁በሚገኝ	-9.80794
▁የደረሰ	-9.8093
▁ከሱዳን	-9.80949
▁ምግባር	-9.80959
▁እቃ	-9.81062
▁ኋላ	-9.81152
27	-9.81154
▁አቤቱታ	-9.81179
▁የሚናገሩት	-9.81208
▁ማእቀፍ	-9.81212
ዮ	-9.81283
▁አሳሳቢ	-9.81325
አዲሱ	-9.81342
▁እንዲፈቱ	-9.8147
▁አድርጎታል	-9.81474
▁በአ	-9.81476
▁መድረስ	-9.81481
▁በአምስት	-9.81598
▁ት	-9.8162
▁የህዝቡን	-9.81636
▁ከዛ	-9.81664
▁የነበራቸው	-9.81667
▁ለመድረስ	-9.8174
▁ተፋሰስ	-9.81759
▁እረፍት	-9.81768
▁ኮንትራት	-9.81797
▁ችለናል	-9.81914
▁አካሂዷል	-9.82128
ኤፍቢሲ	-9.82151
▁ገፅታ	-9.82173
▁በዝርዝር	-9.82235
▁ይፋዊ	-9.82244
▁ዝግጅቶች	-9.82363
▁ታደለ	-9.82521
▁አለመረጋጋት	-9.8259
▁ገፁ	-9.82609
ሙ	-9.82642
▁ተሰምቷል	-9.82644
▁አጀንዳዎች	-9.82708
▁ኮሮና	-9.82718
▁የሁሉም	-9.8279
▁አራተኛ	-9.82792
▁በእነዚህ	-9.828
▁ወረርሽኝን	-9.82815
▁ሽፈራው	-9.82847
▁ከተማዋ	-9.82926
▁አደጋዎች	-9.82937
▁ይህንኑ	-9.83032
▁ሙሌት	-9.83164
▁የያዘ	-9.83183
▁መግለፃቸውን	-9.83201
▁የሙያ	-9.83224
▁ምንዛሬ	-9.83256
▁ብሄረሰብ	-9.83256
▁ያወጣው	-9.83273
▁በምርጫ	-9.8334
▁ካሳሁን	-9.83405
▁ታክስ	-9.83414
▁የሚያደርገውን	-9.83421
▁ጥምረት	-9.83426
▁በኤርትራ	-9.83459
▁ልኡክ	-9.83472
▁የሚያደርጉ	-9.83484
▁አርብቶ	-9.8352
▁ከአሜሪካ	-9.83571
▁የተገለፀ	-9.83613
▁አስረድቷል	-9.83622
▁አልቻለም	-9.83674
▁እንቅፋት	-9.83685
▁መንቀሳቀስ	-9.83714
▁ለመጠበቅ	-9.83722
▁ስርአትን	-9.8375
▁የሙስና	-9.83761
▁በመጨረሻም	-9.83793
▁75	-9.83796
ኛል	-9.83864
▁ይዘን	-9.83865
▁የድል	-9.83931
▁እያከናወነ	-9.83945
▁ቴድሮስ	-9.83969
▁ይገኙበታል	-9.83984
▁እንደሚኖረው	-9.84009
▁ክፍተቶች	-9.84066
60	-9.841
▁ቀንድ	-9.8411
▁ለሚ	-9.84188
▁ላለው	-9.84217
▁አሸንፎ	-9.84224
▁has	-9.84237
▁ፋይናንስ	-9.84258
▁ማእከሉ	-9.84348
▁ቀርቧል	-9.84391
▁እየታየ	-9.84436
▁በቅርበት	-9.84521
▁ለህልፈት	-9.84524
▁ቁሳቁስ	-9.8454
▁ሲሚንቶ	-9.84558
▁አክለውም	-9.8456
▁በመከላከል	-9.8457
▁በሆኑ	-9.84574
▁በተፈጠረው	-9.84594
▁ጠዋት	-9.8461
▁ዛሬም	-9.84663
▁ተማሪ	-9.84809
▁ፍሬው	-9.84823
▁ተወዳዳሪ	-9.84828
▁መስኖና	-9.84859
▁አካላትን	-9.84986
▁የጠበቀ	-9.85007
▁የእርስ	-9.8503
22	-9.85042
▁እንደነበሩ	-9.85043
▁ማንም	-9.85076
▁ማለፍ	-9.85118
▁መክረዋል	-9.8513
▁የተፈጠረው	-9.85135
▁ስርጭትን	-9.85148
▁ባህርዳር	-9.8515
▁የመ	-9.85221
▁ያል	-9.85241
▁ፕሮጀክቶችን	-9.85251
▁ቀበሌዎች	-9.8527
▁በአመቱ	-9.85274
▁ባለመሆኑ	-9.85365
ta	-9.85381
▁ዳይሬክቶሬት	-9.85384
▁ቤተክርስቲያን	-9.85385
▁ኮሙኒኬሽን	-9.85395
▁የሚሰጡ	-9.85437
▁ችግኞች	-9.85536
ችሁ	-9.85544
▁ከሁሉም	-9.8557
▁ይሰጣል	-9.85662
▁የማጥቃት	-9.85666
▁የከተማው	-9.857
▁ሚ	-9.85734
▁ያካተተ	-9.85746
▁ጥልቅ	-9.85772
▁የሙዚቃ	-9.85996
▁ሲጠናቀቅ	-9.86004
ቦ	-9.86017
al	-9.86105
▁አምና	-9.86143
ለው	-9.86145
▁የባንክ	-9.86286
የውጭ	-9.86329
▁e	-9.86385
▁ለበርካታ	-9.86407
▁በምክትል	-9.86436
▁ፈጣሪ	-9.86486
▁ከህዝብ	-9.86601
▁33	-9.8662
አሰልጣኝ	-9.8662
ጋ	-9.86689
▁የበላይነትን	-9.86801
▁ኤስ	-9.86818
ዲ	-9.86827
▁የመኖሪያ	-9.86844
▁ከማድረግ	-9.86852
▁በሂደት	-9.86856
▁አስፈላጊው	-9.86883
▁ማረሚያ	-9.86923
▁ፍጥነት	-9.87102
▁አለመግባባት	-9.87105
▁ለጊዜው	-9.8716
▁ወጣቶችን	-9.87167
▁ከአራት	-9.87229
▁መስራች	-9.87363
▁የኑሮ	-9.87419
▁የበኩላቸውን	-9.87443
▁መያዝ	-9.87462
▁የእድገትና	-9.87478
▁በማሳደግ	-9.87479
▁እንደማይ	-9.87509
▁ማድረጋቸው	-9.87638
▁second	-9.87682
▁Dicha	-9.87695
▁ወንድሙ	-9.87851
▁ምርቶችን	-9.87874
▁በታላቁ	-9.87883
▁ከጨዋታው	-9.87923
▁አመላክተዋል	-9.8793
▁የንግድና	-9.87946
ታዊ	-9.87951
▁ለተጨማሪ	-9.87955
ዛ	-9.87977
▁ዜግነት	-9.87979
▁የተዘጋጀ	-9.88017
▁ደረጃን	-9.88031
▁ውሳኔው	-9.88133
▁ውይይቶች	-9.88156
▁ያንን	-9.88172
▁አስቆጥሮ	-9.88269
▁መፍታት	-9.88271
▁በዘንድሮ	-9.88272
▁ወርቅነህ	-9.88272
▁ነገሮችን	-9.88285
▁ተከላካዩ	-9.88288
▁በማዘጋጀት	-9.88297
▁ዘሪሁን	-9.88304
▁Hawassa	-9.88343
▁ሩብ	-9.88351
▁ለህብረተሰቡ	-9.8837
▁የተፈጠረውን	-9.88475
▁ተቀብለው	-9.88555
▁የመሀል	-9.886
▁ሹመት	-9.88621
▁ማካሄድ	-9.88622
▁የፊታችን	-9.88725
▁ክትባት	-9.88742
▁አሰልጣኝነት	-9.88799
▁የምጣኔ	-9.88869
▁አውሮፓ	-9.8904
▁ስያሜ	-9.89042
▁የወርቅ	-9.8907
▁ደርሶ	-9.8913
▁አቤቤ	-9.89159
▁ካልሆነ	-9.89161
▁እጩ	-9.89171
▁አበረታች	-9.89196
▁ማንነት	-9.89251
ቱን	-9.89265
▁ጥያቄዎችን	-9.89323
▁የመጣው	-9.89359
▁እንድት	-9.89393
▁ሁሉን	-9.89429
▁አግኝቶ	-9.89436
▁በማውጣት	-9.89461
▁ለቆ	-9.89477
▁በፖለቲካ	-9.8949
▁አክለው	-9.89505
▁የሰጠው	-9.89558
▁የገቡት	-9.89575
ሴ	-9.89628
▁they	-9.89633
28	-9.89671
▁ለቪኦኤ	-9.8977
▁ከሚ	-9.89772
▁ቢሮው	-9.8982
▁በተከታታይ	-9.89867
200	-9.89877
▁አለምአቀፍ	-9.89916
▁በእስር	-9.90091
▁ከተማው	-9.90092
▁የአንድነት	-9.90094
▁ጁንታ	-9.90115
▁የተከሰተው	-9.9013
▁ታዲያ	-9.90162
▁ሳምሶን	-9.90167
▁0	-9.90183
▁ጥቆማ	-9.90211
▁አክሊሉ	-9.9038
የክልሉ	-9.90385
▁በአውሮፓ	-9.90389
▁በስምምነት	-9.90487
▁ስላለው	-9.90512
▁እኛም	-9.90534
▁ተቀብሎ	-9.90632
▁ነጋሽ	-9.90676
▁ዲፕሎማሲያዊ	-9.90679
▁የተሳተፉ	-9.90693
▁እንደሚገባቸው	-9.90701
▁Dedebit	-9.90727
▁በበርካታ	-9.90744
▁በፅኑ	-9.90768
▁ውጤቱን	-9.90803
▁ድርቅ	-9.90877
▁የሚመራ	-9.90889
▁የሚችለው	-9.90936
▁የማህበረሰብ	-9.90988
▁ቴሌኮም	-9.91031
▁አስራት	-9.91114
▁minute	-9.91201
▁ለመጀመር	-9.91212
▁ማስጠንቀቂያ	-9.91266
▁አመቱን	-9.91267
▁ፍሬ	-9.91277
▁ስለመሆኑ	-9.91336
▁የዛሬ	-9.91435
መልሶ	-9.91446
▁የሚዲያ	-9.91494
▁ለጠቅላይ	-9.91539
▁መንጋ	-9.91601
▁የመጣ	-9.9166
▁ያህሉ	-9.91787
▁ያሳለፈው	-9.91803
▁ተወልደ	-9.9187
▁በሚቀጥለው	-9.91897
▁ኦርቶዶክስ	-9.91905
▁መዲና	-9.91913
▁የቀረበው	-9.91957
▁ከአምስት	-9.91993
▁የእሳት	-9.92093
▁ደንበኞች	-9.92145
▁ሪፐብሊክ	-9.92169
▁ኡመር	-9.9218
ቷ	-9.92207
▁በፀጥታ	-9.92214
▁ግቢ	-9.923
▁ቀጣይነት	-9.92304
▁ጌታነህ	-9.92339
▁ተጨባጭ	-9.92409
▁ቢጫ	-9.92452
▁ከርቀት	-9.92472
▁ማውጣት	-9.92478
▁ናስር	-9.92497
▁እንስሳት	-9.925
▁ወስኗል	-9.92524
▁በጥናት	-9.92536
▁በህክምና	-9.92549
▁ጨምረው	-9.92572
ምንጭ	-9.92714
▁ተሳትፈዋል	-9.92717
▁ለሰላም	-9.9275
▁የምክክር	-9.92859
▁ግብይት	-9.92875
▁በህይወት	-9.92878
▁ተሰጥቷል	-9.92935
ዩ	-9.9298
▁ለአገር	-9.92988
▁እንዲሁ	-9.93008
▁first	-9.93081
▁ያስታወሱት	-9.93083
▁የአዳማ	-9.9311
▁የህፃናት	-9.93124
▁ወልዲያ	-9.93153
▁wh	-9.9316
26	-9.93226
▁out	-9.93232
▁መዘጋጀቱን	-9.93248
▁ዘላለም	-9.93323
▁የወጣቶች	-9.93326
▁ሶማሌ	-9.93329
▁የቻለ	-9.93357
▁የአረንጓዴ	-9.93417
▁ማእቀብ	-9.93432
▁ሰጥተው	-9.9344
ዶ	-9.93516
▁ኢራን	-9.9357
▁የብሄር	-9.93722
▁ክሱ	-9.93753
▁አን	-9.93791
▁መሸፈኛ	-9.93792
▁በሶማሊያ	-9.93813
▁የተከሰተውን	-9.93819
▁ዝግጅቱን	-9.93842
▁ጆ	-9.93947
ደ	-9.93947
▁ተዋህዶ	-9.9401
▁መስኮት	-9.94014
▁መድረሱ	-9.94021
▁የዘንድሮው	-9.94031
▁አብዛኛው	-9.94045
▁ውሳኔዎች	-9.94083
▁የጎል	-9.94089
▁ታዳጊ	-9.94187
▁በነበራቸው	-9.94307
▁አቆጣጠር	-9.94332
▁ምልልስ	-9.94333
▁ድንገተኛ	-9.94342
▁አገልግሎቱን	-9.94358
▁እዳ	-9.94376
▁ቅጥር	-9.94379
▁ስሙ	-9.94424
▁ለቀጣይ	-9.94435
▁ሩሲያ	-9.94455
▁ለመ	-9.94482
▁ቀጣዩ	-9.94485
▁የልኡካን	-9.94524
▁ገልጧል	-9.94541
▁እየተከናወኑ	-9.94641
▁ጉዳያቸው	-9.94657
vs	-9.94704
▁አስተማማኝ	-9.94739
▁ፖሊሶች	-9.94824
ደቡብ	-9.94826
▁በሞት	-9.94837
▁የቆዩ	-9.94911
▁እየተሰሩ	-9.94953
▁አባጅፋር	-9.94957
▁ባስተላለፉት	-9.94958
▁ሞሀመድ	-9.94991
▁ኢንጅነር	-9.95024
▁የተጀመረውን	-9.95045
▁Mekelakeya	-9.95055
ለተጨማሪ	-9.9509
▁ጥብቅ	-9.95167
▁የዜጎችን	-9.95188
▁ተራ	-9.95244
45	-9.95252
▁ኦማር	-9.95295
▁በማንሳት	-9.95301
▁የህይወት	-9.95316
▁ወንዶች	-9.95479
▁ይኖረዋል	-9.95577
▁የምት	-9.95578
▁Stadium	-9.95578
▁ንጉሱ	-9.95617
▁የገቡ	-9.9562
▁በማስቆጠር	-9.95633
ነቱ	-9.95637
▁ምንተስኖት	-9.95703
▁የድሬዳዋ	-9.95823
▁ቶሎ	-9.95882
▁ደሴ	-9.95944
▁በውድድር	-9.95992
▁ሂሩት	-9.96211
▁አድራጎት	-9.96226
▁ባህልና	-9.96242
▁በረራ	-9.96245
▁እየሰጠ	-9.96245
▁ንክኪ	-9.9627
▁ደረጃውን	-9.96284
▁ሙሳ	-9.96288
▁እየሆነ	-9.96294
▁00	-9.96315
▁የሆነችው	-9.96397
▁የተደረገላቸው	-9.96414
▁የሚመጡ	-9.96418
▁የተጠረጠሩ	-9.96479
▁ሯንዳ	-9.96484
▁እገዳ	-9.96509
▁የተነገረው	-9.96598
▁በአፋር	-9.96602
▁የሰዎች	-9.96659
▁ተወላጆች	-9.96846
▁ከላይ	-9.96846
▁ጠብቆ	-9.96856
▁points	-9.96861
▁ሂሳብ	-9.96868
▁በአማካይ	-9.969
▁በግንባሩ	-9.96901
▁የሚነሱ	-9.97047
ስለ	-9.97089
▁የአስተዳደር	-9.97097
▁41	-9.97109
▁league	-9.97118
▁ደብረ	-9.97167
▁ለማስገባት	-9.97176
▁ለመፈፀም	-9.9718
▁በየ	-9.97185
▁እንዲውል	-9.97187
▁ስለሺ	-9.972
▁ፌዴራል	-9.97215
▁ማስተባበሪያ	-9.97227
▁ሲሰሩ	-9.97249
▁በአየር	-9.97398
▁ስብሰባው	-9.97446
▁እሸቱ	-9.97522
▁ሰርቪስ	-9.97537
▁መርህ	-9.97538
▁የባንኩ	-9.97538
▁ከስልጣን	-9.97567
were	-9.97597
▁የሲቪል	-9.97603
70	-9.97678
▁የማእድን	-9.97711
▁በመደገፍ	-9.97743
▁የለበትም	-9.97814
▁የአፍ	-9.97819
▁ለተለያዩ	-9.9782
▁ለመሳተፍ	-9.97822
▁ዳኝነት	-9.97839
300	-9.97922
▁የበላይ	-9.97942
▁የእርሻ	-9.98094
▁የአሜሪካን	-9.98133
▁ለማስፈን	-9.9815
▁ህጎች	-9.98179
▁የሚፈልጉ	-9.98237
▁አክሲዮን	-9.98261
▁በውይይት	-9.98296
▁team	-9.98414
▁አልቻሉም	-9.98424
▁ወ	-9.9846
▁አይቻልም	-9.98462
▁but	-9.98468
▁ከነገ	-9.98469
▁ከግምት	-9.98472
▁ወንጀሎች	-9.98507
▁በአካል	-9.98535
▁ደጋፊ	-9.9856
▁ወይ	-9.98627
▁ታስቦ	-9.98659
▁መጀመርያ	-9.98679
▁ነጋ	-9.98682
▁እያንዳንዱ	-9.98686
▁እነሱ	-9.98755
▁በአሰልጣኝ	-9.98829
▁የአሰልጣኝ	-9.98909
▁እያካሄደ	-9.98936
▁ያቀረበው	-9.98937
▁የእግርኳስ	-9.98956
▁እንደሚገባው	-9.98972
▁ማህበሩ	-9.98995
▁በመድረኩ	-9.99046
▁አይችልም	-9.99114
▁በመገንባት	-9.99124
ቲ	-9.9917
▁ለሁለተኛ	-9.99207
▁የእድሜ	-9.9921
▁ከአገር	-9.99212
▁የሚኒስትሮች	-9.99226
▁በሀይሉ	-9.99274
ፍፁም	-9.99279
▁ሁለቱን	-9.99284
የአለም	-9.99291
▁ከመሆኑ	-9.99317
▁መሆኑንና	-9.9935
▁እንዲፈጠር	-9.99411
▁በተካሄደ	-9.99427
▁አስኪያጁ	-9.99442
▁ለመሰብሰብ	-9.99446
▁ቤቱን	-9.99464
▁ካፒታል	-9.99471
▁900	-9.99485
▁ለሚሆኑ	-9.99516
▁ምትክ	-9.99619
▁ዘርፉን	-9.99724
▁ልደታ	-9.99762
▁አድሀኖም	-9.99771
▁ሀገራቱ	-9.99774
▁የሶማሊያ	-9.99786
▁ከእስር	-9.99801
ታቸው	-9.99806
▁አማራጮች	-9.99836
▁ለምሳሌ	-9.99849
▁በአገራችን	-9.99849
▁በሚለው	-9.99859
▁በመሄድ	-9.99872
▁የጀመሩት	-9.99956
▁በከተማው	-9.99965
▁አስፈፃሚው	-10.0001
ጥቂት	-10.0002
▁የተዘጋጀው	-10.0008
▁አመልክተው	-10.0011
▁የሚገባው	-10.0012
▁ግዛው	-10.0015
▁ገብረሚካኤል	-10.0015
▁ስፍራው	-10.0015
▁ሚዲያዎች	-10.0017
▁እሴቶች	-10.0018
▁ተከላካዮች	-10.0024
▁መስጠቱን	-10.0025
ሆኖም	-10.0033
▁አንበጣ	-10.0035
▁ያመለከቱት	-10.0039
▁መምራት	-10.0042
▁በትክክል	-10.0044
▁በተገቢው	-10.0045
▁ተናግረው	-10.0046
▁ላለ	-10.0046
▁ብቁ	-10.0047
▁ይዘት	-10.0048
▁በሀይል	-10.0049
▁አቡበከር	-10.0054
▁ሆና	-10.0064
▁ኑሮ	-10.007
▁የመማር	-10.0078
▁አማካዩ	-10.0079
▁በተሰጠው	-10.0085
▁የግድ	-10.0085
▁ባለሙያዎችን	-10.0087
▁ስደተኞችን	-10.0089
▁በተጠናቀቀው	-10.0093
▁በዩናይትድ	-10.0095
▁የክስ	-10.0097
▁አደገኛ	-10.0105
▁የአመራር	-10.0106
▁Cup	-10.011
▁እንድ	-10.0111
▁ቁሳቁሶች	-10.0115
▁አይነቶች	-10.0118
▁ጠቅሷል	-10.0126
▁ጠቃሚ	-10.0128
▁የሚንቀሳቀሱ	-10.0136
▁ካፍ	-10.0136
▁ለማስከበር	-10.014
▁አለማቀፍ	-10.014
▁የአሰራር	-10.014
▁he	-10.0141
በአዲስ	-10.0143
▁ግዛቶች	-10.0145
▁ወረርሽኙ	-10.0146
▁ለመወጣት	-10.0147
▁የተሰኘው	-10.0148
▁አቡነ	-10.0151
▁ሩጫ	-10.0161
▁ግራ	-10.0164
▁በመቃወም	-10.0179
▁አብደላ	-10.0179
▁እናቶች	-10.0182
▁እርሻ	-10.0185
▁ዩጋንዳ	-10.0191
▁ይኖርበታል	-10.0193
▁ህዝበ	-10.0197
ቢ	-10.0202
▁ከተ	-10.0202
▁አስታውሷል	-10.0207
▁አስተዳደሮች	-10.0211
▁ቆይቶ	-10.0211
▁ሆ	-10.0212
▁ቃሊቲ	-10.0212
▁ለዘመናት	-10.0215
▁ዘነበ	-10.0215
▁ተመጣጣኝ	-10.0216
▁እቅዱ	-10.0227
▁መደረግ	-10.0227
▁ገለልተኛ	-10.0229
▁ችግኞችን	-10.0229
▁ጊኒ	-10.0232
▁የእንግሊዝ	-10.0234
▁እንዲኖረው	-10.0245
▁ሀውስ	-10.0247
▁በስፍራው	-10.0249
▁I	-10.0255
▁ውጥረት	-10.0255
▁የሰላምና	-10.0256
▁ሄኖክ	-10.0258
▁የአባይ	-10.0268
▁አቅጣጫዎች	-10.0271
▁እውነት	-10.0277
▁የእንስሳት	-10.028
▁ከመስመር	-10.0281
▁የፊት	-10.0283
ያን	-10.0286
▁መወጣት	-10.0287
▁የአምስት	-10.0288
▁ስምምነቱን	-10.0294
▁የሚደርስ	-10.0294
FBC	-10.0302
▁እርምጃዎችን	-10.0302
▁የአደጋ	-10.0307
▁ነክ	-10.0308
▁የተሰጠውን	-10.0313
▁ይዞታ	-10.0316
▁የወጪ	-10.0317
▁የዋስትና	-10.0349
▁ያስተናገደው	-10.0349
▁የተለያየ	-10.0351
▁ማከናወን	-10.0353
2017	-10.0362
▁ጥናቱ	-10.0372
▁ሜዳሊያ	-10.0374
▁ለማስወገድ	-10.0381
2015	-10.0381
▁የሞከረው	-10.0393
▁ለውጦች	-10.0395
▁በግድቡ	-10.0395
▁ሴቶችን	-10.0396
ቻቸው	-10.0398
ቃ	-10.0405
▁በራስ	-10.0411
ቡ	-10.0412
▁በመጠቆም	-10.0417
▁የቆዩት	-10.0418
ነገር	-10.0429
▁ስለነበር	-10.0429
▁የሳይንስና	-10.0431
▁ሀብረተሰቡ	-10.0435
▁ወንድ	-10.0435
▁ሁኔታዎችን	-10.0445
▁ጎዳና	-10.045
▁አስመልክተው	-10.045
▁ማኔጅመንት	-10.0451
▁ያስታወቁት	-10.0451
▁ልደቱ	-10.0451
▁እሳት	-10.0452
▁ዮሴፍ	-10.0453
▁ባህሪ	-10.0457
ቆ	-10.0458
▁መገርሳ	-10.0461
▁ቦጋለ	-10.0461
▁ኪሳራ	-10.0464
▁በውሀ	-10.0466
▁የመጣውን	-10.0466
▁የጎዳና	-10.0467
▁ካርታ	-10.0471
▁አሳልፏል	-10.0477
▁lead	-10.0478
▁የሚገመት	-10.0487
በተለይም	-10.049
▁ተስማምተዋል	-10.0497
▁የመሳሰሉ	-10.0498
ስተናግዶ	-10.0498
▁ጉዳተኞች	-10.0498
▁አይን	-10.0502
▁አለኝ	-10.0504
▁የኢፌዲሪ	-10.0511
▁የቀረቡ	-10.0514
▁ቀጠና	-10.0517
ጎ	-10.0519
▁እልባት	-10.052
▁የሀብረተሰብ	-10.0522
ክርሮ	-10.0526
▁አባላቱ	-10.0529
▁ዩኒቨርሲቲው	-10.0533
▁ለመጀመርያ	-10.0534
▁የአንበጣ	-10.0539
▁ልብ	-10.054
▁መዋላቸውን	-10.054
▁ከንቲባው	-10.0544
▁ተቋማቱ	-10.0544
▁ይህንንም	-10.0545
▁በፅህፈት	-10.0548
▁ፈተናዎች	-10.0549
▁እየተንቀሳቀሰ	-10.0554
▁እንዲችሉ	-10.0555
▁ማነስ	-10.0555
በር	-10.0556
▁ባይደን	-10.0564
▁የሚቆይ	-10.0564
▁ዲሲ	-10.0567
▁ሳላዲን	-10.0567
▁መሰረትም	-10.0568
▁ተቃዋሚ	-10.0586
▁ቡናዎች	-10.0588
▁ለማለፍ	-10.059
2019	-10.0592
ንግ	-10.0593
▁ብሄሮች	-10.0594
▁በማካሄድ	-10.0596
▁ቱርክ	-10.0602
▁ውስጥም	-10.0604
▁ህሙማን	-10.0607
▁ድጋፉ	-10.0607
▁መጀመር	-10.0621
▁ጀምረዋል	-10.0623
▁ገረመው	-10.0625
▁ቁርጠኝነት	-10.0628
▁ፈቃደኛ	-10.0629
▁የሞት	-10.0633
▁በአባይ	-10.0634
▁የሚታዩ	-10.0637
▁የውድድሩ	-10.0639
▁ፍተሻ	-10.0643
▁ጥናቶች	-10.0646
▁እነ	-10.0648
▁መያዛቸውን	-10.0649
▁1000	-10.0654
▁አርባ	-10.0662
▁ዲላ	-10.0664
▁ከስድስት	-10.0664
▁ማስፈፀሚያ	-10.0665
▁መሄድ	-10.0669
▁የሚያደርጉትን	-10.0674
▁half	-10.0696
▁ስትሆን	-10.0696
▁በመጫወት	-10.0701
▁ኖሮ	-10.0709
▁ቁጥራቸው	-10.0718
▁S	-10.0722
▁በደረሰው	-10.0729
▁የተሻሉ	-10.0731
ዝርዝሩ	-10.0732
2020	-10.0733
▁አቀባዩ	-10.0736
ትን	-10.0738
▁ከመከላከያ	-10.074
▁በዚያ	-10.0742
▁ፕሬዝዳንቱ	-10.0744
▁እርሳቸው	-10.0747
▁አጥ	-10.0747
▁ፓርላማ	-10.0755
▁ባሉበት	-10.0761
▁ለመውሰድ	-10.077
▁የወዳጅነት	-10.077
▁አባት	-10.0771
▁ሚልዮ	-10.0772
እስካሁን	-10.0785
▁ግብአቶች	-10.0786
▁ስለሚ	-10.0787
▁የት	-10.0791
▁በሽታዎች	-10.0795
▁ውሳኔውን	-10.0796
▁34	-10.0797
▁coach	-10.0801
▁ገደማ	-10.0801
▁ክረምት	-10.0803
▁ደበበ	-10.0803
▁ፈታኝ	-10.0804
▁አቅራቢያ	-10.0808
▁በነፃነት	-10.0815
▁መመርያ	-10.0825
▁አምባሳደሩ	-10.0826
▁መፅሀፍ	-10.0827
▁ይገልፃል	-10.0828
▁ኤን	-10.0835
▁እንዲቆም	-10.0838
▁ስፖርታዊ	-10.0845
▁በለይቶ	-10.0845
▁አንተነህ	-10.0848
▁ድርጊቱን	-10.0855
▁በቴክኖሎጂ	-10.0856
▁በኢኮኖሚ	-10.0859
▁የሚገባ	-10.086
▁ማለፉ	-10.0862
▁በአልን	-10.0863
▁ዲኤታ	-10.0864
▁እንዲያ	-10.0864
